/**
 * jQuery TWzipcode plugin
 * https://code.essoduke.org/twzipcode/
 * Copyright 2016 essoduke.org, Licensed MIT.
 *
 * Changelog
 * -------------------------------
 * 修正異體字「台」為正體字「臺」
 *
 * @author essoduke.org
 * @version 1.7.10
 * @license MIT License
 */
;(function ($, window, document, undefined) {

    'use strict';

    // Zipcode JSON data
    var provinceList = [
        // { name:'จังหวัด',cityList:[{name:'', areaList:['']},
        // ] },
        { name:'กรุงเทพมหานคร',cityList:[ {name:'เขตพระนคร', areaList:['รหัสไปรษณีย์','10200',]},
            {name:'เขตดุสิต', areaList:['รหัสไปรษณีย์','10300',]},
            {name:'เขตหนองจอก', areaList:['รหัสไปรษณีย์','10530',]},
            {name:'เขตบางรัก', areaList:['รหัสไปรษณีย์','10500',]},
            {name:'เขตบางเขน', areaList:['รหัสไปรษณีย์','10220',]},
            {name:'เขตบางกะปิ', areaList:['รหัสไปรษณีย์','10240',]},
            {name:'เขตปทุมวัน', areaList:['รหัสไปรษณีย์','10330',]},
            {name:'เขตป้อมปราบศัตรูพ่าย', areaList:['รหัสไปรษณีย์','10100',]},
            {name:'เขตพระโขนง', areaList:['รหัสไปรษณีย์','10260',]},
            {name:'เขตมีนบุรี', areaList:['รหัสไปรษณีย์','10510',]},
            {name:'เขตลาดกระบัง', areaList:['รหัสไปรษณีย์','10520',]},
            {name:'เขตยานนาวา', areaList:['รหัสไปรษณีย์','10120',]},
            {name:'เขตสัมพันธวงศ์', areaList:['รหัสไปรษณีย์','10100',]},
            {name:'เขตพญาไท', areaList:['รหัสไปรษณีย์','10400',]},
            {name:'เขตธนบุรี', areaList:['รหัสไปรษณีย์','10600',]},
            {name:'เขตบางกอกใหญ่', areaList:['รหัสไปรษณีย์','10600',]},
            {name:'เขตห้วยขวาง', areaList:['รหัสไปรษณีย์','10310',]},
            {name:'เขตคลองสาน', areaList:['รหัสไปรษณีย์','10600',]},
            {name:'เขตตลิ่งชัน', areaList:['รหัสไปรษณีย์','10170',]},
            {name:'เขตบางกอกน้อย', areaList:['รหัสไปรษณีย์','10700',]},
            {name:'เขตบางขุนเทียน', areaList:['รหัสไปรษณีย์','10150',]},
            {name:'เขตภาษีเจริญ', areaList:['รหัสไปรษณีย์','10160',]},
            {name:'เขตหนองแขม', areaList:['รหัสไปรษณีย์','10160',]},
            {name:'เขตราษฎร์บูรณะ', areaList:['รหัสไปรษณีย์','10140',]},
            {name:'เขตบางพลัด', areaList:['รหัสไปรษณีย์','10700',]},
            {name:'เขตดินแดง', areaList:['รหัสไปรษณีย์','10400',]},
            {name:'เขตบึงกุ่ม', areaList:['รหัสไปรษณีย์','10240','10230',]},
            {name:'เขตสาทร', areaList:['รหัสไปรษณีย์','10120',]},
            {name:'เขตบางซื่อ', areaList:['รหัสไปรษณีย์','10800',]},
            {name:'เขตจตุจักร', areaList:['รหัสไปรษณีย์','10900',]},
            {name:'เขตบางคอแหลม', areaList:['รหัสไปรษณีย์','10120',]},
            {name:'เขตประเวศ', areaList:['รหัสไปรษณีย์','10250',]},
            {name:'เขตคลองเตย', areaList:['รหัสไปรษณีย์','10110',]},
            {name:'เขตสวนหลวง', areaList:['รหัสไปรษณีย์','10250',]},
            {name:'เขตจอมทอง', areaList:['รหัสไปรษณีย์','10150',]},
            {name:'เขตดอนเมือง', areaList:['รหัสไปรษณีย์','10210',]},
            {name:'เขตราชเทวี', areaList:['รหัสไปรษณีย์','10400',]},
            {name:'เขตลาดพร้าว', areaList:['รหัสไปรษณีย์','10230',]},
            {name:'เขตวัฒนา', areaList:['รหัสไปรษณีย์','10110',]},
            {name:'เขตบางแค', areaList:['รหัสไปรษณีย์','10160',]},
            {name:'เขตหลักสี่', areaList:['รหัสไปรษณีย์','10210',]},
            {name:'เขตสายไหม', areaList:['รหัสไปรษณีย์','10220',]},
            {name:'เขตคันนายาว', areaList:['รหัสไปรษณีย์','10230',]},
            {name:'เขตสะพานสูง', areaList:['รหัสไปรษณีย์','10240',]},
            {name:'เขตวังทองหลาง', areaList:['รหัสไปรษณีย์','10310',]},
            {name:'เขตคลองสามวา', areaList:['รหัสไปรษณีย์','10510',]},
            {name:'เขตบางนา', areaList:['รหัสไปรษณีย์','10260',]},
            {name:'เขตทวีวัฒนา', areaList:['รหัสไปรษณีย์','10170',]},
            {name:'เขตทุ่งครุ', areaList:['รหัสไปรษณีย์','10140',]},
            {name:'เขตบางบอน', areaList:['รหัสไปรษณีย์','10150',]},
        ] },
        { name:'สมุทรปราการ',cityList:[ {name:'อำเภอเมืองสมุทรปราการ', areaList:['รหัสไปรษณีย์','10270','10280',]},
            {name:'อำเภอบางบ่อ', areaList:['รหัสไปรษณีย์','10560','10550',]},
            {name:'อำเภอบางพลี', areaList:['รหัสไปรษณีย์','10540',]},
            {name:'อำเภอพระประแดง', areaList:['รหัสไปรษณีย์','10130',]},
            {name:'อำเภอพระสมุทรเจดีย์', areaList:['รหัสไปรษณีย์','10290',]},
            {name:'อำเภอบางเสาธง', areaList:['รหัสไปรษณีย์','10540',]},
        ] },
        { name:'นนทบุรี',cityList:[ {name:'อำเภอเมืองนนทบุรี', areaList:['รหัสไปรษณีย์','11000',]},
            {name:'อำเภอบางกรวย', areaList:['รหัสไปรษณีย์','11130',]},
            {name:'อำเภอบางใหญ่', areaList:['รหัสไปรษณีย์','11140',]},
            {name:'อำเภอบางบัวทอง', areaList:['รหัสไปรษณีย์','11110',]},
            {name:'อำเภอไทรน้อย', areaList:['รหัสไปรษณีย์','11150',]},
            {name:'อำเภอปากเกร็ด', areaList:['รหัสไปรษณีย์','11120',]},
        ] },
        { name:'ปทุมธานี',cityList:[ {name:'อำเภอเมืองปทุมธานี', areaList:['รหัสไปรษณีย์','12000',]},
            {name:'อำเภอคลองหลวง', areaList:['รหัสไปรษณีย์','12120',]},
            {name:'อำเภอธัญบุรี', areaList:['รหัสไปรษณีย์','12130','12110',]},
            {name:'อำเภอหนองเสือ', areaList:['รหัสไปรษณีย์','12170',]},
            {name:'อำเภอลาดหลุมแก้ว', areaList:['รหัสไปรษณีย์','12140',]},
            {name:'อำเภอลำลูกกา', areaList:['รหัสไปรษณีย์','12130','12150',]},
            {name:'อำเภอสามโคก', areaList:['รหัสไปรษณีย์','12160',]},
        ] },
        { name:'พระนครศรีอยุธยา',cityList:[ {name:'อำเภอพระนครศรีอยุธยา', areaList:['รหัสไปรษณีย์','13000',]},
            {name:'อำเภอท่าเรือ', areaList:['รหัสไปรษณีย์','13130',]},
            {name:'อำเภอนครหลวง', areaList:['รหัสไปรษณีย์','13260',]},
            {name:'อำเภอบางไทร', areaList:['รหัสไปรษณีย์','13190','13290',]},
            {name:'อำเภอบางบาล', areaList:['รหัสไปรษณีย์','13250',]},
            {name:'อำเภอบางปะอิน', areaList:['รหัสไปรษณีย์','13160','13180','13170',]},
            {name:'อำเภอบางปะหัน', areaList:['รหัสไปรษณีย์','13220',]},
            {name:'อำเภอผักไห่', areaList:['รหัสไปรษณีย์','13120','13280',]},
            {name:'อำเภอภาชี', areaList:['รหัสไปรษณีย์','13140',]},
            {name:'อำเภอลาดบัวหลวง', areaList:['รหัสไปรษณีย์','13230',]},
            {name:'อำเภอวังน้อย', areaList:['รหัสไปรษณีย์','13170',]},
            {name:'อำเภอเสนา', areaList:['รหัสไปรษณีย์','13110',]},
            {name:'อำเภอบางซ้าย', areaList:['รหัสไปรษณีย์','13270',]},
            {name:'อำเภออุทัย', areaList:['รหัสไปรษณีย์','13210',]},
            {name:'อำเภอมหาราช', areaList:['รหัสไปรษณีย์','13150',]},
            {name:'อำเภอบ้านแพรก', areaList:['รหัสไปรษณีย์','13240',]},
        ] },
        { name:'อ่างทอง',cityList:[ {name:'อำเภอเมืองอ่างทอง', areaList:['รหัสไปรษณีย์','14000',]},
            {name:'อำเภอไชโย', areaList:['รหัสไปรษณีย์','14140',]},
            {name:'อำเภอป่าโมก', areaList:['รหัสไปรษณีย์','14130',]},
            {name:'อำเภอโพธิ์ทอง', areaList:['รหัสไปรษณีย์','14120',]},
            {name:'อำเภอแสวงหา', areaList:['รหัสไปรษณีย์','14150',]},
            {name:'อำเภอวิเศษชัยชาญ', areaList:['รหัสไปรษณีย์','14110',]},
            {name:'อำเภอสามโก้', areaList:['รหัสไปรษณีย์','14160',]},
        ] },
        { name:'ลพบุรี',cityList:[ {name:'อำเภอเมืองลพบุรี', areaList:['รหัสไปรษณีย์','15000','13240','15160','15210',]},
            {name:'อำเภอพัฒนานิคม', areaList:['รหัสไปรษณีย์','15140','15220','18220',]},
            {name:'อำเภอโคกสำโรง', areaList:['รหัสไปรษณีย์','15120',]},
            {name:'อำเภอชัยบาดาล', areaList:['รหัสไปรษณีย์','15130','15230','15190',]},
            {name:'อำเภอท่าวุ้ง', areaList:['รหัสไปรษณีย์','15150','15180',]},
            {name:'อำเภอบ้านหมี่', areaList:['รหัสไปรษณีย์','15110','15180',]},
            {name:'อำเภอท่าหลวง', areaList:['รหัสไปรษณีย์','15230',]},
            {name:'อำเภอสระโบสถ์', areaList:['รหัสไปรษณีย์','15240',]},
            {name:'อำเภอโคกเจริญ', areaList:['รหัสไปรษณีย์','15250',]},
            {name:'อำเภอลำสนธิ', areaList:['รหัสไปรษณีย์','15190','15130',]},
            {name:'อำเภอหนองม่วง', areaList:['รหัสไปรษณีย์','15170',]},
        ] },
        { name:'สิงห์บุรี',cityList:[ {name:'อำเภอเมืองสิงห์บุรี', areaList:['รหัสไปรษณีย์','16000',]},
            {name:'อำเภอบางระจัน', areaList:['รหัสไปรษณีย์','16130',]},
            {name:'อำเภอค่ายบางระจัน', areaList:['รหัสไปรษณีย์','16150',]},
            {name:'อำเภอพรหมบุรี', areaList:['รหัสไปรษณีย์','16120','16160',]},
            {name:'อำเภอท่าช้าง', areaList:['รหัสไปรษณีย์','16140',]},
            {name:'อำเภออินทร์บุรี', areaList:['รหัสไปรษณีย์','16110',]},
        ] },
        { name:'ชัยนาท',cityList:[ {name:'อำเภอเมืองชัยนาท', areaList:['รหัสไปรษณีย์','17000',]},
            {name:'อำเภอมโนรมย์', areaList:['รหัสไปรษณีย์','17110','17170',]},
            {name:'อำเภอวัดสิงห์', areaList:['รหัสไปรษณีย์','17120',]},
            {name:'อำเภอสรรพยา', areaList:['รหัสไปรษณีย์','17150',]},
            {name:'อำเภอสรรคบุรี', areaList:['รหัสไปรษณีย์','17140',]},
            {name:'อำเภอหันคา', areaList:['รหัสไปรษณีย์','17130','17160',]},
            {name:'อำเภอหนองมะโมง', areaList:['รหัสไปรษณีย์','17120',]},
            {name:'อำเภอเนินขาม', areaList:['รหัสไปรษณีย์','17130',]},
        ] },
        { name:'สระบุรี',cityList:[ {name:'อำเภอเมืองสระบุรี', areaList:['รหัสไปรษณีย์','18000',]},
            {name:'อำเภอแก่งคอย', areaList:['รหัสไปรษณีย์','18110','18260',]},
            {name:'อำเภอหนองแค', areaList:['รหัสไปรษณีย์','18140','18250','18230',]},
            {name:'อำเภอวิหารแดง', areaList:['รหัสไปรษณีย์','18150',]},
            {name:'อำเภอหนองแซง', areaList:['รหัสไปรษณีย์','18170',]},
            {name:'อำเภอบ้านหมอ', areaList:['รหัสไปรษณีย์','18130','18270',]},
            {name:'อำเภอดอนพุด', areaList:['รหัสไปรษณีย์','18210',]},
            {name:'อำเภอหนองโดน', areaList:['รหัสไปรษณีย์','18190',]},
            {name:'อำเภอพระพุทธบาท', areaList:['รหัสไปรษณีย์','18120',]},
            {name:'อำเภอเสาไห้', areaList:['รหัสไปรษณีย์','18160',]},
            {name:'อำเภอมวกเหล็ก', areaList:['รหัสไปรษณีย์','18180','30130','18220',]},
            {name:'อำเภอวังม่วง', areaList:['รหัสไปรษณีย์','18220',]},
            {name:'อำเภอเฉลิมพระเกียรติ', areaList:['รหัสไปรษณีย์','18000','18240',]},
        ] },
        { name:'ชลบุรี',cityList:[ {name:'อำเภอเมืองชลบุรี', areaList:['รหัสไปรษณีย์','20000','20130',]},
            {name:'อำเภอบ้านบึง', areaList:['รหัสไปรษณีย์','20170','20220',]},
            {name:'อำเภอหนองใหญ่', areaList:['รหัสไปรษณีย์','20190',]},
            {name:'อำเภอบางละมุง', areaList:['รหัสไปรษณีย์','20150',]},
            {name:'อำเภอพานทอง', areaList:['รหัสไปรษณีย์','20160',]},
            {name:'อำเภอพนัสนิคม', areaList:['รหัสไปรษณีย์','20140',]},
            {name:'อำเภอศรีราชา', areaList:['รหัสไปรษณีย์','20110','20230',]},
            {name:'อำเภอเกาะสีชัง', areaList:['รหัสไปรษณีย์','20120',]},
            {name:'อำเภอสัตหีบ', areaList:['รหัสไปรษณีย์','20180','20250',]},
            {name:'อำเภอบ่อทอง', areaList:['รหัสไปรษณีย์','20270',]},
            {name:'อำเภอเกาะจันทร์', areaList:['รหัสไปรษณีย์','20240',]},
        ] },
        { name:'ระยอง',cityList:[ {name:'อำเภอเมืองระยอง', areaList:['รหัสไปรษณีย์','21000','21160','21100','21150',]},
            {name:'อำเภอบ้านฉาง', areaList:['รหัสไปรษณีย์','21130',]},
            {name:'อำเภอแกลง', areaList:['รหัสไปรษณีย์','21110','21190','22160','21170',]},
            {name:'อำเภอวังจันทร์', areaList:['รหัสไปรษณีย์','21210',]},
            {name:'อำเภอบ้านค่าย', areaList:['รหัสไปรษณีย์','21120',]},
            {name:'อำเภอปลวกแดง', areaList:['รหัสไปรษณีย์','21140',]},
            {name:'อำเภอเขาชะเมา', areaList:['รหัสไปรษณีย์','21110',]},
            {name:'อำเภอนิคมพัฒนา', areaList:['รหัสไปรษณีย์','21180',]},
        ] },
        { name:'จันทบุรี',cityList:[ {name:'อำเภอเมืองจันทบุรี', areaList:['รหัสไปรษณีย์','22000',]},
            {name:'อำเภอขลุง', areaList:['รหัสไปรษณีย์','22110','22150',]},
            {name:'อำเภอท่าใหม่', areaList:['รหัสไปรษณีย์','22120','22170',]},
            {name:'อำเภอโป่งน้ำร้อน', areaList:['รหัสไปรษณีย์','22140',]},
            {name:'อำเภอมะขาม', areaList:['รหัสไปรษณีย์','22150',]},
            {name:'อำเภอแหลมสิงห์', areaList:['รหัสไปรษณีย์','22130','22190','22120',]},
            {name:'อำเภอสอยดาว', areaList:['รหัสไปรษณีย์','22180',]},
            {name:'อำเภอแก่งหางแมว', areaList:['รหัสไปรษณีย์','22160',]},
            {name:'อำเภอนายายอาม', areaList:['รหัสไปรษณีย์','22160','22170',]},
            {name:'อำเภอเขาคิชฌกูฏ', areaList:['รหัสไปรษณีย์','22210',]},
        ] },
        { name:'ตราด',cityList:[ {name:'อำเภอเมืองตราด', areaList:['รหัสไปรษณีย์','23000',]},
            {name:'อำเภอคลองใหญ่', areaList:['รหัสไปรษณีย์','23110',]},
            {name:'อำเภอเขาสมิง', areaList:['รหัสไปรษณีย์','23130','23150',]},
            {name:'อำเภอบ่อไร่', areaList:['รหัสไปรษณีย์','23140',]},
            {name:'อำเภอแหลมงอบ', areaList:['รหัสไปรษณีย์','23120',]},
            {name:'อำเภอเกาะกูด', areaList:['รหัสไปรษณีย์','23000',]},
            {name:'อำเภอเกาะช้าง', areaList:['รหัสไปรษณีย์','23170',]},
        ] },
        { name:'ฉะเชิงเทรา',cityList:[ {name:'อำเภอเมืองฉะเชิงเทรา', areaList:['รหัสไปรษณีย์','24000',]},
            {name:'อำเภอบางคล้า', areaList:['รหัสไปรษณีย์','24110',]},
            {name:'อำเภอบางน้ำเปรี้ยว', areaList:['รหัสไปรษณีย์','24150','24170','24000',]},
            {name:'อำเภอบางปะกง', areaList:['รหัสไปรษณีย์','24130','24180',]},
            {name:'อำเภอบ้านโพธิ์', areaList:['รหัสไปรษณีย์','24140',]},
            {name:'อำเภอพนมสารคาม', areaList:['รหัสไปรษณีย์','24120',]},
            {name:'อำเภอราชสาส์น', areaList:['รหัสไปรษณีย์','24120',]},
            {name:'อำเภอสนามชัยเขต', areaList:['รหัสไปรษณีย์','24160',]},
            {name:'อำเภอแปลงยาว', areaList:['รหัสไปรษณีย์','24190',]},
            {name:'อำเภอท่าตะเกียบ', areaList:['รหัสไปรษณีย์','24160',]},
            {name:'อำเภอคลองเขื่อน', areaList:['รหัสไปรษณีย์','24000','24110',]},
        ] },
        { name:'ปราจีนบุรี',cityList:[ {name:'อำเภอเมืองปราจีนบุรี', areaList:['รหัสไปรษณีย์','25000','25230',]},
            {name:'อำเภอกบินทร์บุรี', areaList:['รหัสไปรษณีย์','25110','25240',]},
            {name:'อำเภอนาดี', areaList:['รหัสไปรษณีย์','25220',]},
            {name:'อำเภอบ้านสร้าง', areaList:['รหัสไปรษณีย์','25150',]},
            {name:'อำเภอประจันตคาม', areaList:['รหัสไปรษณีย์','25130',]},
            {name:'อำเภอศรีมหาโพธิ', areaList:['รหัสไปรษณีย์','25140',]},
            {name:'อำเภอศรีมโหสถ', areaList:['รหัสไปรษณีย์','25190',]},
        ] },
        { name:'นครนายก',cityList:[ {name:'อำเภอเมืองนครนายก', areaList:['รหัสไปรษณีย์','26000',]},
            {name:'อำเภอปากพลี', areaList:['รหัสไปรษณีย์','26130',]},
            {name:'อำเภอบ้านนา', areaList:['รหัสไปรษณีย์','26110',]},
            {name:'อำเภอองครักษ์', areaList:['รหัสไปรษณีย์','26120',]},
        ] },
        { name:'สระแก้ว',cityList:[ {name:'อำเภอเมืองสระแก้ว', areaList:['รหัสไปรษณีย์','27000',]},
            {name:'อำเภอคลองหาด', areaList:['รหัสไปรษณีย์','27260',]},
            {name:'อำเภอตาพระยา', areaList:['รหัสไปรษณีย์','27180',]},
            {name:'อำเภอวังน้ำเย็น', areaList:['รหัสไปรษณีย์','27210',]},
            {name:'อำเภอวัฒนานคร', areaList:['รหัสไปรษณีย์','27160',]},
            {name:'อำเภออรัญประเทศ', areaList:['รหัสไปรษณีย์','27120',]},
            {name:'อำเภอเขาฉกรรจ์', areaList:['รหัสไปรษณีย์','27000',]},
            {name:'อำเภอโคกสูง', areaList:['รหัสไปรษณีย์','27120','27180',]},
            {name:'อำเภอวังสมบูรณ์', areaList:['รหัสไปรษณีย์','27250',]},
        ] },
        { name:'นครราชสีมา',cityList:[ {name:'อำเภอเมืองนครราชสีมา', areaList:['รหัสไปรษณีย์','30000','30310','30280',]},
            {name:'อำเภอครบุรี', areaList:['รหัสไปรษณีย์','30250',]},
            {name:'อำเภอเสิงสาง', areaList:['รหัสไปรษณีย์','30330',]},
            {name:'อำเภอคง', areaList:['รหัสไปรษณีย์','30260',]},
            {name:'อำเภอบ้านเหลื่อม', areaList:['รหัสไปรษณีย์','30350',]},
            {name:'อำเภอจักราช', areaList:['รหัสไปรษณีย์','30230',]},
            {name:'อำเภอโชคชัย', areaList:['รหัสไปรษณีย์','30190',]},
            {name:'อำเภอด่านขุนทด', areaList:['รหัสไปรษณีย์','30210','36220',]},
            {name:'อำเภอโนนไทย', areaList:['รหัสไปรษณีย์','30220',]},
            {name:'อำเภอโนนสูง', areaList:['รหัสไปรษณีย์','30160','30420',]},
            {name:'อำเภอขามสะแกแสง', areaList:['รหัสไปรษณีย์','30290',]},
            {name:'อำเภอบัวใหญ่', areaList:['รหัสไปรษณีย์','30120',]},
            {name:'อำเภอประทาย', areaList:['รหัสไปรษณีย์','30180',]},
            {name:'อำเภอปักธงชัย', areaList:['รหัสไปรษณีย์','30150',]},
            {name:'อำเภอพิมาย', areaList:['รหัสไปรษณีย์','30110',]},
            {name:'อำเภอห้วยแถลง', areaList:['รหัสไปรษณีย์','30240',]},
            {name:'อำเภอชุมพวง', areaList:['รหัสไปรษณีย์','30270',]},
            {name:'อำเภอสูงเนิน', areaList:['รหัสไปรษณีย์','30170','30380',]},
            {name:'อำเภอขามทะเลสอ', areaList:['รหัสไปรษณีย์','30280',]},
            {name:'อำเภอสีคิ้ว', areaList:['รหัสไปรษณีย์','30140','30340',]},
            {name:'อำเภอปากช่อง', areaList:['รหัสไปรษณีย์','30130','30320',]},
            {name:'อำเภอหนองบุญมาก', areaList:['รหัสไปรษณีย์','30410',]},
            {name:'อำเภอแก้งสนามนาง', areaList:['รหัสไปรษณีย์','30440',]},
            {name:'อำเภอโนนแดง', areaList:['รหัสไปรษณีย์','30360',]},
            {name:'อำเภอวังน้ำเขียว', areaList:['รหัสไปรษณีย์','30370','30150',]},
            {name:'อำเภอเทพารักษ์', areaList:['รหัสไปรษณีย์','30210',]},
            {name:'อำเภอเมืองยาง', areaList:['รหัสไปรษณีย์','30270',]},
            {name:'อำเภอพระทองคำ', areaList:['รหัสไปรษณีย์','30220',]},
            {name:'อำเภอลำทะเมนชัย', areaList:['รหัสไปรษณีย์','30270',]},
            {name:'อำเภอบัวลาย', areaList:['รหัสไปรษณีย์','30120',]},
            {name:'อำเภอสีดา', areaList:['รหัสไปรษณีย์','30430',]},
            {name:'อำเภอเฉลิมพระเกียรติ', areaList:['รหัสไปรษณีย์','30230','30000',]},
        ] },
        { name:'บุรีรัมย์',cityList:[ {name:'อำเภอเมืองบุรีรัมย์', areaList:['รหัสไปรษณีย์','31000',]},
            {name:'อำเภอคูเมือง', areaList:['รหัสไปรษณีย์','31190',]},
            {name:'อำเภอกระสัง', areaList:['รหัสไปรษณีย์','31160',]},
            {name:'อำเภอนางรอง', areaList:['รหัสไปรษณีย์','31110',]},
            {name:'อำเภอหนองกี่', areaList:['รหัสไปรษณีย์','31210',]},
            {name:'อำเภอละหานทราย', areaList:['รหัสไปรษณีย์','31170',]},
            {name:'อำเภอประโคนชัย', areaList:['รหัสไปรษณีย์','31140',]},
            {name:'อำเภอบ้านกรวด', areaList:['รหัสไปรษณีย์','31180',]},
            {name:'อำเภอพุทไธสง', areaList:['รหัสไปรษณีย์','31120',]},
            {name:'อำเภอลำปลายมาศ', areaList:['รหัสไปรษณีย์','31130',]},
            {name:'อำเภอสตึก', areaList:['รหัสไปรษณีย์','31150',]},
            {name:'อำเภอปะคำ', areaList:['รหัสไปรษณีย์','31220',]},
            {name:'อำเภอนาโพธิ์', areaList:['รหัสไปรษณีย์','31230',]},
            {name:'อำเภอหนองหงส์', areaList:['รหัสไปรษณีย์','31240',]},
            {name:'อำเภอพลับพลาชัย', areaList:['รหัสไปรษณีย์','31250',]},
            {name:'อำเภอห้วยราช', areaList:['รหัสไปรษณีย์','31000',]},
            {name:'อำเภอโนนสุวรรณ', areaList:['รหัสไปรษณีย์','31110',]},
            {name:'อำเภอชำนิ', areaList:['รหัสไปรษณีย์','31110',]},
            {name:'อำเภอบ้านใหม่ไชยพจน์', areaList:['รหัสไปรษณีย์','31120',]},
            {name:'อำเภอโนนดินแดง', areaList:['รหัสไปรษณีย์','31260',]},
            {name:'อำเภอบ้านด่าน', areaList:['รหัสไปรษณีย์','31000',]},
            {name:'อำเภอแคนดง', areaList:['รหัสไปรษณีย์','31150',]},
            {name:'อำเภอเฉลิมพระเกียรติ', areaList:['รหัสไปรษณีย์','31110','31170',]},
        ] },
        { name:'สุรินทร์',cityList:[ {name:'อำเภอเมืองสุรินทร์', areaList:['รหัสไปรษณีย์','32000',]},
            {name:'อำเภอชุมพลบุรี', areaList:['รหัสไปรษณีย์','32190',]},
            {name:'อำเภอท่าตูม', areaList:['รหัสไปรษณีย์','32120',]},
            {name:'อำเภอจอมพระ', areaList:['รหัสไปรษณีย์','32180',]},
            {name:'อำเภอปราสาท', areaList:['รหัสไปรษณีย์','32140',]},
            {name:'อำเภอกาบเชิง', areaList:['รหัสไปรษณีย์','32210',]},
            {name:'อำเภอรัตนบุรี', areaList:['รหัสไปรษณีย์','32130',]},
            {name:'อำเภอสนม', areaList:['รหัสไปรษณีย์','32160',]},
            {name:'อำเภอศีขรภูมิ', areaList:['รหัสไปรษณีย์','32110',]},
            {name:'อำเภอสังขะ', areaList:['รหัสไปรษณีย์','32150',]},
            {name:'อำเภอลำดวน', areaList:['รหัสไปรษณีย์','32220',]},
            {name:'อำเภอสำโรงทาบ', areaList:['รหัสไปรษณีย์','32170',]},
            {name:'อำเภอบัวเชด', areaList:['รหัสไปรษณีย์','32230',]},
            {name:'อำเภอพนมดงรัก', areaList:['รหัสไปรษณีย์','32140',]},
            {name:'อำเภอศรีณรงค์', areaList:['รหัสไปรษณีย์','32150',]},
            {name:'อำเภอเขวาสินรินทร์', areaList:['รหัสไปรษณีย์','32000',]},
            {name:'อำเภอโนนนารายณ์', areaList:['รหัสไปรษณีย์','32130',]},
        ] },
        { name:'ศรีสะเกษ',cityList:[ {name:'อำเภอเมืองศรีสะเกษ', areaList:['รหัสไปรษณีย์','33000',]},
            {name:'อำเภอยางชุมน้อย', areaList:['รหัสไปรษณีย์','33190',]},
            {name:'อำเภอกันทรารมย์', areaList:['รหัสไปรษณีย์','33130',]},
            {name:'อำเภอกันทรลักษ์', areaList:['รหัสไปรษณีย์','33110',]},
            {name:'อำเภอขุขันธ์', areaList:['รหัสไปรษณีย์','33140',]},
            {name:'อำเภอไพรบึง', areaList:['รหัสไปรษณีย์','33180',]},
            {name:'อำเภอปรางค์กู่', areaList:['รหัสไปรษณีย์','33170',]},
            {name:'อำเภอขุนหาญ', areaList:['รหัสไปรษณีย์','33150',]},
            {name:'อำเภอราษีไศล', areaList:['รหัสไปรษณีย์','33160',]},
            {name:'อำเภออุทุมพรพิสัย', areaList:['รหัสไปรษณีย์','33120',]},
            {name:'อำเภอบึงบูรพ์', areaList:['รหัสไปรษณีย์','33220',]},
            {name:'อำเภอห้วยทับทัน', areaList:['รหัสไปรษณีย์','33210',]},
            {name:'อำเภอโนนคูณ', areaList:['รหัสไปรษณีย์','33250',]},
            {name:'อำเภอศรีรัตนะ', areaList:['รหัสไปรษณีย์','33240',]},
            {name:'อำเภอน้ำเกลี้ยง', areaList:['รหัสไปรษณีย์','33130',]},
            {name:'อำเภอวังหิน', areaList:['รหัสไปรษณีย์','33270',]},
            {name:'อำเภอภูสิงห์', areaList:['รหัสไปรษณีย์','33140',]},
            {name:'อำเภอเมืองจันทร์', areaList:['รหัสไปรษณีย์','33120',]},
            {name:'อำเภอเบญจลักษ์', areaList:['รหัสไปรษณีย์','33110',]},
            {name:'อำเภอพยุห์', areaList:['รหัสไปรษณีย์','33230',]},
            {name:'อำเภอโพธิ์ศรีสุวรรณ', areaList:['รหัสไปรษณีย์','33120',]},
            {name:'อำเภอศิลาลาด', areaList:['รหัสไปรษณีย์','33160',]},
        ] },
        { name:'อุบลราชธานี',cityList:[ {name:'อำเภอเมืองอุบลราชธานี', areaList:['รหัสไปรษณีย์','34000',]},
            {name:'อำเภอศรีเมืองใหม่', areaList:['รหัสไปรษณีย์','34250',]},
            {name:'อำเภอโขงเจียม', areaList:['รหัสไปรษณีย์','34220',]},
            {name:'อำเภอเขื่องใน', areaList:['รหัสไปรษณีย์','34150','34320',]},
            {name:'อำเภอเขมราฐ', areaList:['รหัสไปรษณีย์','34170',]},
            {name:'อำเภอเดชอุดม', areaList:['รหัสไปรษณีย์','34160',]},
            {name:'อำเภอนาจะหลวย', areaList:['รหัสไปรษณีย์','34280',]},
            {name:'อำเภอน้ำยืน', areaList:['รหัสไปรษณีย์','34260',]},
            {name:'อำเภอบุณฑริก', areaList:['รหัสไปรษณีย์','34230',]},
            {name:'อำเภอตระการพืชผล', areaList:['รหัสไปรษณีย์','34130',]},
            {name:'อำเภอกุดข้าวปุ้น', areaList:['รหัสไปรษณีย์','34270',]},
            {name:'อำเภอม่วงสามสิบ', areaList:['รหัสไปรษณีย์','34140',]},
            {name:'อำเภอวารินชำราบ', areaList:['รหัสไปรษณีย์','34190','34310',]},
            {name:'อำเภอพิบูลมังสาหาร', areaList:['รหัสไปรษณีย์','34110',]},
            {name:'อำเภอตาลสุม', areaList:['รหัสไปรษณีย์','34330',]},
            {name:'อำเภอโพธิ์ไทร', areaList:['รหัสไปรษณีย์','34340',]},
            {name:'อำเภอสำโรง', areaList:['รหัสไปรษณีย์','34360',]},
            {name:'อำเภอดอนมดแดง', areaList:['รหัสไปรษณีย์','34000',]},
            {name:'อำเภอสิรินธร', areaList:['รหัสไปรษณีย์','34350',]},
            {name:'อำเภอทุ่งศรีอุดม', areaList:['รหัสไปรษณีย์','34160',]},
            {name:'อำเภอนาเยีย', areaList:['รหัสไปรษณีย์','34160',]},
            {name:'อำเภอนาตาล', areaList:['รหัสไปรษณีย์','34170',]},
            {name:'อำเภอเหล่าเสือโก้ก', areaList:['รหัสไปรษณีย์','34000',]},
            {name:'อำเภอสว่างวีระวงศ์', areaList:['รหัสไปรษณีย์','34190',]},
            {name:'อำเภอน้ำขุ่น', areaList:['รหัสไปรษณีย์','34260',]},
        ] },
        { name:'ยโสธร',cityList:[ {name:'อำเภอเมืองยโสธร', areaList:['รหัสไปรษณีย์','35000',]},
            {name:'อำเภอทรายมูล', areaList:['รหัสไปรษณีย์','35170',]},
            {name:'อำเภอกุดชุม', areaList:['รหัสไปรษณีย์','35140',]},
            {name:'อำเภอคำเขื่อนแก้ว', areaList:['รหัสไปรษณีย์','35110','35180',]},
            {name:'อำเภอป่าติ้ว', areaList:['รหัสไปรษณีย์','35150',]},
            {name:'อำเภอมหาชนะชัย', areaList:['รหัสไปรษณีย์','35130',]},
            {name:'อำเภอค้อวัง', areaList:['รหัสไปรษณีย์','35160',]},
            {name:'อำเภอเลิงนกทา', areaList:['รหัสไปรษณีย์','35120',]},
            {name:'อำเภอไทยเจริญ', areaList:['รหัสไปรษณีย์','35120',]},
        ] },
        { name:'ชัยภูมิ',cityList:[ {name:'อำเภอเมืองชัยภูมิ', areaList:['รหัสไปรษณีย์','36000','36240',]},
            {name:'อำเภอบ้านเขว้า', areaList:['รหัสไปรษณีย์','36170',]},
            {name:'อำเภอคอนสวรรค์', areaList:['รหัสไปรษณีย์','36140',]},
            {name:'อำเภอเกษตรสมบูรณ์', areaList:['รหัสไปรษณีย์','36120',]},
            {name:'อำเภอหนองบัวแดง', areaList:['รหัสไปรษณีย์','36210',]},
            {name:'อำเภอจัตุรัส', areaList:['รหัสไปรษณีย์','36130','36220',]},
            {name:'อำเภอบำเหน็จณรงค์', areaList:['รหัสไปรษณีย์','36160','36220',]},
            {name:'อำเภอหนองบัวระเหว', areaList:['รหัสไปรษณีย์','36250',]},
            {name:'อำเภอเทพสถิต', areaList:['รหัสไปรษณีย์','36230',]},
            {name:'อำเภอภูเขียว', areaList:['รหัสไปรษณีย์','36110',]},
            {name:'อำเภอบ้านแท่น', areaList:['รหัสไปรษณีย์','36190',]},
            {name:'อำเภอแก้งคร้อ', areaList:['รหัสไปรษณีย์','36150',]},
            {name:'อำเภอคอนสาร', areaList:['รหัสไปรษณีย์','36180',]},
            {name:'อำเภอภักดีชุมพล', areaList:['รหัสไปรษณีย์','36260',]},
            {name:'อำเภอเนินสง่า', areaList:['รหัสไปรษณีย์','36130',]},
            {name:'อำเภอซับใหญ่', areaList:['รหัสไปรษณีย์','36130',]},
        ] },
        { name:'อำนาจเจริญ',cityList:[ {name:'อำเภอเมืองอำนาจเจริญ', areaList:['รหัสไปรษณีย์','37000',]},
            {name:'อำเภอชานุมาน', areaList:['รหัสไปรษณีย์','37210',]},
            {name:'อำเภอปทุมราชวงศา', areaList:['รหัสไปรษณีย์','37110',]},
            {name:'อำเภอพนา', areaList:['รหัสไปรษณีย์','37180',]},
            {name:'อำเภอเสนางคนิคม', areaList:['รหัสไปรษณีย์','37290',]},
            {name:'อำเภอหัวตะพาน', areaList:['รหัสไปรษณีย์','37240',]},
            {name:'อำเภอลืออำนาจ', areaList:['รหัสไปรษณีย์','37000',]},
        ] },
        { name:'บึงกาฬ',cityList:[ {name:'อำเภอเมืองบึงกาฬ', areaList:['รหัสไปรษณีย์','38000',]},
            {name:'อำเภอพรเจริญ', areaList:['รหัสไปรษณีย์','38180',]},
            {name:'อำเภอโซ่พิสัย', areaList:['รหัสไปรษณีย์','38170',]},
            {name:'อำเภอเซกา', areaList:['รหัสไปรษณีย์','38150',]},
            {name:'อำเภอปากคาด', areaList:['รหัสไปรษณีย์','38190',]},
            {name:'อำเภอบึงโขงหลง', areaList:['รหัสไปรษณีย์','38220',]},
            {name:'อำเภอศรีวิไล', areaList:['รหัสไปรษณีย์','38210',]},
            {name:'อำเภอบุ่งคล้า', areaList:['รหัสไปรษณีย์','38000',]},
        ] },
        { name:'หนองบัวลำภู',cityList:[ {name:'อำเภอเมืองหนองบัวลำภู', areaList:['รหัสไปรษณีย์','39000',]},
            {name:'อำเภอนากลาง', areaList:['รหัสไปรษณีย์','39170','39350',]},
            {name:'อำเภอโนนสัง', areaList:['รหัสไปรษณีย์','39140',]},
            {name:'อำเภอศรีบุญเรือง', areaList:['รหัสไปรษณีย์','39180',]},
            {name:'อำเภอสุวรรณคูหา', areaList:['รหัสไปรษณีย์','39270',]},
            {name:'อำเภอนาวัง', areaList:['รหัสไปรษณีย์','39170',]},
        ] },
        { name:'ขอนแก่น',cityList:[ {name:'อำเภอเมืองขอนแก่น', areaList:['รหัสไปรษณีย์','40000','40260',]},
            {name:'อำเภอบ้านฝาง', areaList:['รหัสไปรษณีย์','40270',]},
            {name:'อำเภอพระยืน', areaList:['รหัสไปรษณีย์','40320',]},
            {name:'อำเภอหนองเรือ', areaList:['รหัสไปรษณีย์','40210','40240',]},
            {name:'อำเภอชุมแพ', areaList:['รหัสไปรษณีย์','40130','40290',]},
            {name:'อำเภอสีชมพู', areaList:['รหัสไปรษณีย์','40220',]},
            {name:'อำเภอน้ำพอง', areaList:['รหัสไปรษณีย์','40140','40310',]},
            {name:'อำเภออุบลรัตน์', areaList:['รหัสไปรษณีย์','40250',]},
            {name:'อำเภอกระนวน', areaList:['รหัสไปรษณีย์','40170',]},
            {name:'อำเภอบ้านไผ่', areaList:['รหัสไปรษณีย์','40110',]},
            {name:'อำเภอเปือยน้อย', areaList:['รหัสไปรษณีย์','40340',]},
            {name:'อำเภอพล', areaList:['รหัสไปรษณีย์','40120',]},
            {name:'อำเภอแวงใหญ่', areaList:['รหัสไปรษณีย์','40330',]},
            {name:'อำเภอแวงน้อย', areaList:['รหัสไปรษณีย์','40230',]},
            {name:'อำเภอหนองสองห้อง', areaList:['รหัสไปรษณีย์','40190',]},
            {name:'อำเภอภูเวียง', areaList:['รหัสไปรษณีย์','40150',]},
            {name:'อำเภอมัญจาคีรี', areaList:['รหัสไปรษณีย์','40160',]},
            {name:'อำเภอชนบท', areaList:['รหัสไปรษณีย์','40180',]},
            {name:'อำเภอเขาสวนกวาง', areaList:['รหัสไปรษณีย์','40280',]},
            {name:'อำเภอภูผาม่าน', areaList:['รหัสไปรษณีย์','40350',]},
            {name:'อำเภอซำสูง', areaList:['รหัสไปรษณีย์','40170',]},
            {name:'อำเภอโคกโพธิ์ไชย', areaList:['รหัสไปรษณีย์','40160',]},
            {name:'อำเภอหนองนาคำ', areaList:['รหัสไปรษณีย์','40150',]},
            {name:'อำเภอบ้านแฮด', areaList:['รหัสไปรษณีย์','40110',]},
            {name:'อำเภอโนนศิลา', areaList:['รหัสไปรษณีย์','40110',]},
            {name:'อำเภอเวียงเก่า', areaList:['รหัสไปรษณีย์','40150',]},
        ] },
        { name:'อุดรธานี',cityList:[ {name:'อำเภอเมืองอุดรธานี', areaList:['รหัสไปรษณีย์','41000','41330',]},
            {name:'อำเภอกุดจับ', areaList:['รหัสไปรษณีย์','41250',]},
            {name:'อำเภอหนองวัวซอ', areaList:['รหัสไปรษณีย์','41360','41220',]},
            {name:'อำเภอกุมภวาปี', areaList:['รหัสไปรษณีย์','41110','41370',]},
            {name:'อำเภอโนนสะอาด', areaList:['รหัสไปรษณีย์','41240',]},
            {name:'อำเภอหนองหาน', areaList:['รหัสไปรษณีย์','41130','41320',]},
            {name:'อำเภอทุ่งฝน', areaList:['รหัสไปรษณีย์','41310',]},
            {name:'อำเภอไชยวาน', areaList:['รหัสไปรษณีย์','41290',]},
            {name:'อำเภอศรีธาตุ', areaList:['รหัสไปรษณีย์','41230',]},
            {name:'อำเภอวังสามหมอ', areaList:['รหัสไปรษณีย์','41280',]},
            {name:'อำเภอบ้านดุง', areaList:['รหัสไปรษณีย์','41190',]},
            {name:'อำเภอบ้านผือ', areaList:['รหัสไปรษณีย์','41160',]},
            {name:'อำเภอน้ำโสม', areaList:['รหัสไปรษณีย์','41210',]},
            {name:'อำเภอเพ็ญ', areaList:['รหัสไปรษณีย์','41150',]},
            {name:'อำเภอสร้างคอม', areaList:['รหัสไปรษณีย์','41260',]},
            {name:'อำเภอหนองแสง', areaList:['รหัสไปรษณีย์','41340',]},
            {name:'อำเภอนายูง', areaList:['รหัสไปรษณีย์','41380',]},
            {name:'อำเภอพิบูลย์รักษ์', areaList:['รหัสไปรษณีย์','41130',]},
            {name:'อำเภอกู่แก้ว', areaList:['รหัสไปรษณีย์','41130',]},
            {name:'อำเภอประจักษ์ศิลปาคม', areaList:['รหัสไปรษณีย์','41110',]},
        ] },
        { name:'เลย',cityList:[ {name:'อำเภอเมืองเลย', areaList:['รหัสไปรษณีย์','42000','42100',]},
            {name:'อำเภอนาด้วง', areaList:['รหัสไปรษณีย์','42210',]},
            {name:'อำเภอเชียงคาน', areaList:['รหัสไปรษณีย์','42110',]},
            {name:'อำเภอปากชม', areaList:['รหัสไปรษณีย์','42150',]},
            {name:'อำเภอด่านซ้าย', areaList:['รหัสไปรษณีย์','42120',]},
            {name:'อำเภอนาแห้ว', areaList:['รหัสไปรษณีย์','42170',]},
            {name:'อำเภอภูเรือ', areaList:['รหัสไปรษณีย์','42160',]},
            {name:'อำเภอท่าลี่', areaList:['รหัสไปรษณีย์','42140',]},
            {name:'อำเภอวังสะพุง', areaList:['รหัสไปรษณีย์','42130',]},
            {name:'อำเภอภูกระดึง', areaList:['รหัสไปรษณีย์','42180',]},
            {name:'อำเภอภูหลวง', areaList:['รหัสไปรษณีย์','42230',]},
            {name:'อำเภอผาขาว', areaList:['รหัสไปรษณีย์','42240',]},
            {name:'อำเภอเอราวัณ', areaList:['รหัสไปรษณีย์','42220',]},
            {name:'อำเภอหนองหิน', areaList:['รหัสไปรษณีย์','42190',]},
        ] },
        { name:'หนองคาย',cityList:[ {name:'อำเภอเมืองหนองคาย', areaList:['รหัสไปรษณีย์','43000','43100',]},
            {name:'อำเภอท่าบ่อ', areaList:['รหัสไปรษณีย์','43110',]},
            {name:'อำเภอโพนพิสัย', areaList:['รหัสไปรษณีย์','43120',]},
            {name:'อำเภอศรีเชียงใหม่', areaList:['รหัสไปรษณีย์','43130',]},
            {name:'อำเภอสังคม', areaList:['รหัสไปรษณีย์','43160',]},
            {name:'อำเภอสระใคร', areaList:['รหัสไปรษณีย์','43100',]},
            {name:'อำเภอเฝ้าไร่', areaList:['รหัสไปรษณีย์','43120',]},
            {name:'อำเภอรัตนวาปี', areaList:['รหัสไปรษณีย์','43120',]},
            {name:'อำเภอโพธิ์ตาก', areaList:['รหัสไปรษณีย์','43130',]},
        ] },
        { name:'มหาสารคาม',cityList:[ {name:'อำเภอเมืองมหาสารคาม', areaList:['รหัสไปรษณีย์','44000',]},
            {name:'อำเภอแกดำ', areaList:['รหัสไปรษณีย์','44190',]},
            {name:'อำเภอโกสุมพิสัย', areaList:['รหัสไปรษณีย์','44140',]},
            {name:'อำเภอกันทรวิชัย', areaList:['รหัสไปรษณีย์','44150',]},
            {name:'อำเภอเชียงยืน', areaList:['รหัสไปรษณีย์','44160',]},
            {name:'อำเภอบรบือ', areaList:['รหัสไปรษณีย์','44130',]},
            {name:'อำเภอนาเชือก', areaList:['รหัสไปรษณีย์','44170',]},
            {name:'อำเภอพยัคฆภูมิพิสัย', areaList:['รหัสไปรษณีย์','44110',]},
            {name:'อำเภอวาปีปทุม', areaList:['รหัสไปรษณีย์','44120',]},
            {name:'อำเภอนาดูน', areaList:['รหัสไปรษณีย์','44180',]},
            {name:'อำเภอยางสีสุราช', areaList:['รหัสไปรษณีย์','44210',]},
            {name:'อำเภอกุดรัง', areaList:['รหัสไปรษณีย์','44130',]},
            {name:'อำเภอชื่นชม', areaList:['รหัสไปรษณีย์','44160',]},
        ] },
        { name:'ร้อยเอ็ด',cityList:[ {name:'อำเภอเมืองร้อยเอ็ด', areaList:['รหัสไปรษณีย์','45000',]},
            {name:'อำเภอเกษตรวิสัย', areaList:['รหัสไปรษณีย์','45150',]},
            {name:'อำเภอปทุมรัตต์', areaList:['รหัสไปรษณีย์','45190',]},
            {name:'อำเภอจตุรพักตรพิมาน', areaList:['รหัสไปรษณีย์','45180',]},
            {name:'อำเภอธวัชบุรี', areaList:['รหัสไปรษณีย์','45170',]},
            {name:'อำเภอพนมไพร', areaList:['รหัสไปรษณีย์','45140',]},
            {name:'อำเภอโพนทอง', areaList:['รหัสไปรษณีย์','45110',]},
            {name:'อำเภอโพธิ์ชัย', areaList:['รหัสไปรษณีย์','45230',]},
            {name:'อำเภอหนองพอก', areaList:['รหัสไปรษณีย์','45210',]},
            {name:'อำเภอเสลภูมิ', areaList:['รหัสไปรษณีย์','45120',]},
            {name:'อำเภอสุวรรณภูมิ', areaList:['รหัสไปรษณีย์','45130',]},
            {name:'อำเภอเมืองสรวง', areaList:['รหัสไปรษณีย์','45220',]},
            {name:'อำเภอโพนทราย', areaList:['รหัสไปรษณีย์','45240',]},
            {name:'อำเภออาจสามารถ', areaList:['รหัสไปรษณีย์','45160',]},
            {name:'อำเภอเมยวดี', areaList:['รหัสไปรษณีย์','45250',]},
            {name:'อำเภอศรีสมเด็จ', areaList:['รหัสไปรษณีย์','45000','45280',]},
            {name:'อำเภอจังหาร', areaList:['รหัสไปรษณีย์','45000',]},
            {name:'อำเภอเชียงขวัญ', areaList:['รหัสไปรษณีย์','45000','45170',]},
            {name:'อำเภอหนองฮี', areaList:['รหัสไปรษณีย์','45140',]},
            {name:'อำเภอทุ่งเขาหลวง', areaList:['รหัสไปรษณีย์','45170',]},
        ] },
        { name:'กาฬสินธุ์',cityList:[ {name:'อำเภอเมืองกาฬสินธุ์', areaList:['รหัสไปรษณีย์','46000',]},
            {name:'อำเภอนามน', areaList:['รหัสไปรษณีย์','46230',]},
            {name:'อำเภอกมลาไสย', areaList:['รหัสไปรษณีย์','46130',]},
            {name:'อำเภอร่องคำ', areaList:['รหัสไปรษณีย์','46210',]},
            {name:'อำเภอกุฉินารายณ์', areaList:['รหัสไปรษณีย์','46110',]},
            {name:'อำเภอเขาวง', areaList:['รหัสไปรษณีย์','46160',]},
            {name:'อำเภอยางตลาด', areaList:['รหัสไปรษณีย์','46120',]},
            {name:'อำเภอห้วยเม็ก', areaList:['รหัสไปรษณีย์','46170',]},
            {name:'อำเภอสหัสขันธ์', areaList:['รหัสไปรษณีย์','46140',]},
            {name:'อำเภอคำม่วง', areaList:['รหัสไปรษณีย์','46180',]},
            {name:'อำเภอท่าคันโท', areaList:['รหัสไปรษณีย์','46190',]},
            {name:'อำเภอหนองกุงศรี', areaList:['รหัสไปรษณีย์','46220',]},
            {name:'อำเภอสมเด็จ', areaList:['รหัสไปรษณีย์','46150',]},
            {name:'อำเภอห้วยผึ้ง', areaList:['รหัสไปรษณีย์','46240',]},
            {name:'อำเภอสามชัย', areaList:['รหัสไปรษณีย์','46180',]},
            {name:'อำเภอนาคู', areaList:['รหัสไปรษณีย์','46160',]},
            {name:'อำเภอดอนจาน', areaList:['รหัสไปรษณีย์','46000',]},
            {name:'อำเภอฆ้องชัย', areaList:['รหัสไปรษณีย์','46130',]},
        ] },
        { name:'สกลนคร',cityList:[ {name:'อำเภอเมืองสกลนคร', areaList:['รหัสไปรษณีย์','47000','47220','47230',]},
            {name:'อำเภอกุสุมาลย์', areaList:['รหัสไปรษณีย์','47210','47230',]},
            {name:'อำเภอกุดบาก', areaList:['รหัสไปรษณีย์','47180',]},
            {name:'อำเภอพรรณานิคม', areaList:['รหัสไปรษณีย์','47130','47220',]},
            {name:'อำเภอพังโคน', areaList:['รหัสไปรษณีย์','47160',]},
            {name:'อำเภอวาริชภูมิ', areaList:['รหัสไปรษณีย์','47150',]},
            {name:'อำเภอนิคมน้ำอูน', areaList:['รหัสไปรษณีย์','47270',]},
            {name:'อำเภอวานรนิวาส', areaList:['รหัสไปรษณีย์','47120',]},
            {name:'อำเภอคำตากล้า', areaList:['รหัสไปรษณีย์','47250',]},
            {name:'อำเภอบ้านม่วง', areaList:['รหัสไปรษณีย์','47140',]},
            {name:'อำเภออากาศอำนวย', areaList:['รหัสไปรษณีย์','47170',]},
            {name:'อำเภอสว่างแดนดิน', areaList:['รหัสไปรษณีย์','47110','47240',]},
            {name:'อำเภอส่องดาว', areaList:['รหัสไปรษณีย์','47190',]},
            {name:'อำเภอเต่างอย', areaList:['รหัสไปรษณีย์','47260',]},
            {name:'อำเภอโคกศรีสุพรรณ', areaList:['รหัสไปรษณีย์','47280',]},
            {name:'อำเภอเจริญศิลป์', areaList:['รหัสไปรษณีย์','47290',]},
            {name:'อำเภอโพนนาแก้ว', areaList:['รหัสไปรษณีย์','47230',]},
            {name:'อำเภอภูพาน', areaList:['รหัสไปรษณีย์','47180',]},
        ] },
        { name:'นครพนม',cityList:[ {name:'อำเภอเมืองนครพนม', areaList:['รหัสไปรษณีย์','48000',]},
            {name:'อำเภอปลาปาก', areaList:['รหัสไปรษณีย์','48160',]},
            {name:'อำเภอท่าอุเทน', areaList:['รหัสไปรษณีย์','48120',]},
            {name:'อำเภอบ้านแพง', areaList:['รหัสไปรษณีย์','48140',]},
            {name:'อำเภอธาตุพนม', areaList:['รหัสไปรษณีย์','48110',]},
            {name:'อำเภอเรณูนคร', areaList:['รหัสไปรษณีย์','48170',]},
            {name:'อำเภอนาแก', areaList:['รหัสไปรษณีย์','48130',]},
            {name:'อำเภอศรีสงคราม', areaList:['รหัสไปรษณีย์','48150',]},
            {name:'อำเภอนาหว้า', areaList:['รหัสไปรษณีย์','48180',]},
            {name:'อำเภอโพนสวรรค์', areaList:['รหัสไปรษณีย์','48190',]},
            {name:'อำเภอนาทม', areaList:['รหัสไปรษณีย์','48140',]},
            {name:'อำเภอวังยาง', areaList:['รหัสไปรษณีย์','48130',]},
        ] },
        { name:'มุกดาหาร',cityList:[ {name:'อำเภอเมืองมุกดาหาร', areaList:['รหัสไปรษณีย์','49000',]},
            {name:'อำเภอนิคมคำสร้อย', areaList:['รหัสไปรษณีย์','49130',]},
            {name:'อำเภอดอนตาล', areaList:['รหัสไปรษณีย์','49120',]},
            {name:'อำเภอดงหลวง', areaList:['รหัสไปรษณีย์','49140',]},
            {name:'อำเภอคำชะอี', areaList:['รหัสไปรษณีย์','49110',]},
            {name:'อำเภอหว้านใหญ่', areaList:['รหัสไปรษณีย์','49150',]},
            {name:'อำเภอหนองสูง', areaList:['รหัสไปรษณีย์','49160',]},
        ] },
        { name:'เชียงใหม่',cityList:[ {name:'อำเภอเมืองเชียงใหม่', areaList:['รหัสไปรษณีย์','50200','50100','50300','50000',]},
            {name:'อำเภอจอมทอง', areaList:['รหัสไปรษณีย์','50160','50240',]},
            {name:'อำเภอแม่แจ่ม', areaList:['รหัสไปรษณีย์','50270',]},
            {name:'อำเภอเชียงดาว', areaList:['รหัสไปรษณีย์','50170',]},
            {name:'อำเภอดอยสะเก็ด', areaList:['รหัสไปรษณีย์','50220',]},
            {name:'อำเภอแม่แตง', areaList:['รหัสไปรษณีย์','50150','50330',]},
            {name:'อำเภอแม่ริม', areaList:['รหัสไปรษณีย์','50180','50330',]},
            {name:'อำเภอสะเมิง', areaList:['รหัสไปรษณีย์','50250',]},
            {name:'อำเภอฝาง', areaList:['รหัสไปรษณีย์','50110','50320',]},
            {name:'อำเภอแม่อาย', areaList:['รหัสไปรษณีย์','50280',]},
            {name:'อำเภอพร้าว', areaList:['รหัสไปรษณีย์','50190',]},
            {name:'อำเภอสันป่าตอง', areaList:['รหัสไปรษณีย์','50120',]},
            {name:'อำเภอสันกำแพง', areaList:['รหัสไปรษณีย์','50130',]},
            {name:'อำเภอสันทราย', areaList:['รหัสไปรษณีย์','50210','50290',]},
            {name:'อำเภอหางดง', areaList:['รหัสไปรษณีย์','50230','50340',]},
            {name:'อำเภอฮอด', areaList:['รหัสไปรษณีย์','50240',]},
            {name:'อำเภอดอยเต่า', areaList:['รหัสไปรษณีย์','50260',]},
            {name:'อำเภออมก๋อย', areaList:['รหัสไปรษณีย์','50310',]},
            {name:'อำเภอสารภี', areaList:['รหัสไปรษณีย์','50140',]},
            {name:'อำเภอเวียงแหง', areaList:['รหัสไปรษณีย์','50350',]},
            {name:'อำเภอไชยปราการ', areaList:['รหัสไปรษณีย์','50320',]},
            {name:'อำเภอแม่วาง', areaList:['รหัสไปรษณีย์','50360',]},
            {name:'อำเภอแม่ออน', areaList:['รหัสไปรษณีย์','50130',]},
            {name:'อำเภอดอยหล่อ', areaList:['รหัสไปรษณีย์','50160',]},
            {name:'อำเภอกัลยาณิวัฒนา', areaList:['รหัสไปรษณีย์','58130',]},
        ] },
        { name:'ลำพูน',cityList:[ {name:'อำเภอเมืองลำพูน', areaList:['รหัสไปรษณีย์','51000','51150',]},
            {name:'อำเภอแม่ทา', areaList:['รหัสไปรษณีย์','51140','51170',]},
            {name:'อำเภอบ้านโฮ่ง', areaList:['รหัสไปรษณีย์','51130',]},
            {name:'อำเภอลี้', areaList:['รหัสไปรษณีย์','51110',]},
            {name:'อำเภอทุ่งหัวช้าง', areaList:['รหัสไปรษณีย์','51160',]},
            {name:'อำเภอป่าซาง', areaList:['รหัสไปรษณีย์','51120',]},
            {name:'อำเภอบ้านธิ', areaList:['รหัสไปรษณีย์','51180',]},
            {name:'อำเภอเวียงหนองล่อง', areaList:['รหัสไปรษณีย์','51120',]},
        ] },
        { name:'ลำปาง',cityList:[ {name:'อำเภอเมืองลำปาง', areaList:['รหัสไปรษณีย์','52000','52100',]},
            {name:'อำเภอแม่เมาะ', areaList:['รหัสไปรษณีย์','52220',]},
            {name:'อำเภอเกาะคา', areaList:['รหัสไปรษณีย์','52130',]},
            {name:'อำเภอเสริมงาม', areaList:['รหัสไปรษณีย์','52210',]},
            {name:'อำเภองาว', areaList:['รหัสไปรษณีย์','52110',]},
            {name:'อำเภอแจ้ห่ม', areaList:['รหัสไปรษณีย์','52120',]},
            {name:'อำเภอวังเหนือ', areaList:['รหัสไปรษณีย์','52140',]},
            {name:'อำเภอเถิน', areaList:['รหัสไปรษณีย์','52160','52230',]},
            {name:'อำเภอแม่พริก', areaList:['รหัสไปรษณีย์','52180',]},
            {name:'อำเภอแม่ทะ', areaList:['รหัสไปรษณีย์','52150',]},
            {name:'อำเภอสบปราบ', areaList:['รหัสไปรษณีย์','52170',]},
            {name:'อำเภอห้างฉัตร', areaList:['รหัสไปรษณีย์','52190',]},
            {name:'อำเภอเมืองปาน', areaList:['รหัสไปรษณีย์','52240',]},
        ] },
        { name:'อุตรดิตถ์',cityList:[ {name:'อำเภอเมืองอุตรดิตถ์', areaList:['รหัสไปรษณีย์','53000','53170',]},
            {name:'อำเภอตรอน', areaList:['รหัสไปรษณีย์','53140',]},
            {name:'อำเภอท่าปลา', areaList:['รหัสไปรษณีย์','53150','53190','53110',]},
            {name:'อำเภอน้ำปาด', areaList:['รหัสไปรษณีย์','53110',]},
            {name:'อำเภอฟากท่า', areaList:['รหัสไปรษณีย์','53160',]},
            {name:'อำเภอบ้านโคก', areaList:['รหัสไปรษณีย์','53180',]},
            {name:'อำเภอพิชัย', areaList:['รหัสไปรษณีย์','53120','53220',]},
            {name:'อำเภอลับแล', areaList:['รหัสไปรษณีย์','53130','53210',]},
            {name:'อำเภอทองแสนขัน', areaList:['รหัสไปรษณีย์','53230',]},
        ] },
        { name:'แพร่',cityList:[ {name:'อำเภอเมืองแพร่', areaList:['รหัสไปรษณีย์','54000',]},
            {name:'อำเภอร้องกวาง', areaList:['รหัสไปรษณีย์','54140',]},
            {name:'อำเภอลอง', areaList:['รหัสไปรษณีย์','54150',]},
            {name:'อำเภอสูงเม่น', areaList:['รหัสไปรษณีย์','54130','54000',]},
            {name:'อำเภอเด่นชัย', areaList:['รหัสไปรษณีย์','54110',]},
            {name:'อำเภอสอง', areaList:['รหัสไปรษณีย์','54120',]},
            {name:'อำเภอวังชิ้น', areaList:['รหัสไปรษณีย์','54160',]},
            {name:'อำเภอหนองม่วงไข่', areaList:['รหัสไปรษณีย์','54170',]},
        ] },
        { name:'น่าน',cityList:[ {name:'อำเภอเมืองน่าน', areaList:['รหัสไปรษณีย์','55000',]},
            {name:'อำเภอแม่จริม', areaList:['รหัสไปรษณีย์','55170',]},
            {name:'อำเภอบ้านหลวง', areaList:['รหัสไปรษณีย์','55190',]},
            {name:'อำเภอนาน้อย', areaList:['รหัสไปรษณีย์','55150',]},
            {name:'อำเภอปัว', areaList:['รหัสไปรษณีย์','55120',]},
            {name:'อำเภอท่าวังผา', areaList:['รหัสไปรษณีย์','55140',]},
            {name:'อำเภอเวียงสา', areaList:['รหัสไปรษณีย์','55110',]},
            {name:'อำเภอทุ่งช้าง', areaList:['รหัสไปรษณีย์','55130',]},
            {name:'อำเภอเชียงกลาง', areaList:['รหัสไปรษณีย์','55160',]},
            {name:'อำเภอนาหมื่น', areaList:['รหัสไปรษณีย์','55180',]},
            {name:'อำเภอสันติสุข', areaList:['รหัสไปรษณีย์','55210',]},
            {name:'อำเภอบ่อเกลือ', areaList:['รหัสไปรษณีย์','55220',]},
            {name:'อำเภอสองแคว', areaList:['รหัสไปรษณีย์','55160',]},
            {name:'อำเภอภูเพียง', areaList:['รหัสไปรษณีย์','55000',]},
            {name:'อำเภอเฉลิมพระเกียรติ', areaList:['รหัสไปรษณีย์','55130',]},
        ] },
        { name:'พะเยา',cityList:[ {name:'อำเภอเมืองพะเยา', areaList:['รหัสไปรษณีย์','56000',]},
            {name:'อำเภอจุน', areaList:['รหัสไปรษณีย์','56150',]},
            {name:'อำเภอเชียงคำ', areaList:['รหัสไปรษณีย์','56110',]},
            {name:'อำเภอเชียงม่วน', areaList:['รหัสไปรษณีย์','56160',]},
            {name:'อำเภอดอกคำใต้', areaList:['รหัสไปรษณีย์','56120',]},
            {name:'อำเภอปง', areaList:['รหัสไปรษณีย์','56140',]},
            {name:'อำเภอแม่ใจ', areaList:['รหัสไปรษณีย์','56130',]},
            {name:'อำเภอภูซาง', areaList:['รหัสไปรษณีย์','56110',]},
            {name:'อำเภอภูกามยาว', areaList:['รหัสไปรษณีย์','56000',]},
        ] },
        { name:'เชียงราย',cityList:[ {name:'อำเภอเมืองเชียงราย', areaList:['รหัสไปรษณีย์','57000','57100',]},
            {name:'อำเภอเวียงชัย', areaList:['รหัสไปรษณีย์','57210',]},
            {name:'อำเภอเชียงของ', areaList:['รหัสไปรษณีย์','57140',]},
            {name:'อำเภอเทิง', areaList:['รหัสไปรษณีย์','57160','57230',]},
            {name:'อำเภอพาน', areaList:['รหัสไปรษณีย์','57120','57250','57280',]},
            {name:'อำเภอป่าแดด', areaList:['รหัสไปรษณีย์','57190',]},
            {name:'อำเภอแม่จัน', areaList:['รหัสไปรษณีย์','57110','57270','57240',]},
            {name:'อำเภอเชียงแสน', areaList:['รหัสไปรษณีย์','57150',]},
            {name:'อำเภอแม่สาย', areaList:['รหัสไปรษณีย์','57130','57220',]},
            {name:'อำเภอแม่สรวย', areaList:['รหัสไปรษณีย์','57180',]},
            {name:'อำเภอเวียงป่าเป้า', areaList:['รหัสไปรษณีย์','57170','57260',]},
            {name:'อำเภอพญาเม็งราย', areaList:['รหัสไปรษณีย์','57290',]},
            {name:'อำเภอเวียงแก่น', areaList:['รหัสไปรษณีย์','57310',]},
            {name:'อำเภอขุนตาล', areaList:['รหัสไปรษณีย์','57340',]},
            {name:'อำเภอแม่ฟ้าหลวง', areaList:['รหัสไปรษณีย์','57240','57110',]},
            {name:'อำเภอแม่ลาว', areaList:['รหัสไปรษณีย์','57250','57000',]},
            {name:'อำเภอเวียงเชียงรุ้ง', areaList:['รหัสไปรษณีย์','57210',]},
            {name:'อำเภอดอยหลวง', areaList:['รหัสไปรษณีย์','57110',]},
        ] },
        { name:'แม่ฮ่องสอน',cityList:[ {name:'อำเภอเมืองแม่ฮ่องสอน', areaList:['รหัสไปรษณีย์','58000',]},
            {name:'อำเภอขุนยวม', areaList:['รหัสไปรษณีย์','58140',]},
            {name:'อำเภอปาย', areaList:['รหัสไปรษณีย์','58130',]},
            {name:'อำเภอแม่สะเรียง', areaList:['รหัสไปรษณีย์','58110',]},
            {name:'อำเภอแม่ลาน้อย', areaList:['รหัสไปรษณีย์','58120',]},
            {name:'อำเภอสบเมย', areaList:['รหัสไปรษณีย์','58110',]},
            {name:'อำเภอปางมะผ้า', areaList:['รหัสไปรษณีย์','58150',]},
        ] },
        { name:'นครสวรรค์',cityList:[ {name:'อำเภอเมืองนครสวรรค์', areaList:['รหัสไปรษณีย์','60000','60240',]},
            {name:'อำเภอโกรกพระ', areaList:['รหัสไปรษณีย์','60170',]},
            {name:'อำเภอชุมแสง', areaList:['รหัสไปรษณีย์','60120','60250',]},
            {name:'อำเภอหนองบัว', areaList:['รหัสไปรษณีย์','60110',]},
            {name:'อำเภอบรรพตพิสัย', areaList:['รหัสไปรษณีย์','60180',]},
            {name:'อำเภอเก้าเลี้ยว', areaList:['รหัสไปรษณีย์','60230',]},
            {name:'อำเภอตาคลี', areaList:['รหัสไปรษณีย์','60140','60210','60260',]},
            {name:'อำเภอท่าตะโก', areaList:['รหัสไปรษณีย์','60160',]},
            {name:'อำเภอไพศาลี', areaList:['รหัสไปรษณีย์','60220',]},
            {name:'อำเภอพยุหะคีรี', areaList:['รหัสไปรษณีย์','60130',]},
            {name:'อำเภอลาดยาว', areaList:['รหัสไปรษณีย์','60150',]},
            {name:'อำเภอตากฟ้า', areaList:['รหัสไปรษณีย์','60190',]},
            {name:'อำเภอแม่วงก์', areaList:['รหัสไปรษณีย์','60150',]},
            {name:'อำเภอแม่เปิน', areaList:['รหัสไปรษณีย์','60150',]},
            {name:'อำเภอชุมตาบง', areaList:['รหัสไปรษณีย์','60150',]},
        ] },
        { name:'อุทัยธานี',cityList:[ {name:'อำเภอเมืองอุทัยธานี', areaList:['รหัสไปรษณีย์','61000',]},
            {name:'อำเภอทัพทัน', areaList:['รหัสไปรษณีย์','61120',]},
            {name:'อำเภอสว่างอารมณ์', areaList:['รหัสไปรษณีย์','61150',]},
            {name:'อำเภอหนองฉาง', areaList:['รหัสไปรษณีย์','61110','61170',]},
            {name:'อำเภอหนองขาหย่าง', areaList:['รหัสไปรษณีย์','61130',]},
            {name:'อำเภอบ้านไร่', areaList:['รหัสไปรษณีย์','61140','61180',]},
            {name:'อำเภอลานสัก', areaList:['รหัสไปรษณีย์','61160',]},
            {name:'อำเภอห้วยคต', areaList:['รหัสไปรษณีย์','61170',]},
        ] },
        { name:'กำแพงเพชร',cityList:[ {name:'อำเภอเมืองกำแพงเพชร', areaList:['รหัสไปรษณีย์','62000','62160',]},
            {name:'อำเภอไทรงาม', areaList:['รหัสไปรษณีย์','62150',]},
            {name:'อำเภอคลองลาน', areaList:['รหัสไปรษณีย์','62180',]},
            {name:'อำเภอขาณุวรลักษบุรี', areaList:['รหัสไปรษณีย์','62130','62140',]},
            {name:'อำเภอคลองขลุง', areaList:['รหัสไปรษณีย์','62120',]},
            {name:'อำเภอพรานกระต่าย', areaList:['รหัสไปรษณีย์','62110',]},
            {name:'อำเภอลานกระบือ', areaList:['รหัสไปรษณีย์','62170',]},
            {name:'อำเภอทรายทองวัฒนา', areaList:['รหัสไปรษณีย์','62190',]},
            {name:'อำเภอปางศิลาทอง', areaList:['รหัสไปรษณีย์','62120',]},
            {name:'อำเภอบึงสามัคคี', areaList:['รหัสไปรษณีย์','62210',]},
            {name:'อำเภอโกสัมพีนคร', areaList:['รหัสไปรษณีย์','62000',]},
        ] },
        { name:'ตาก',cityList:[ {name:'อำเภอเมืองตาก', areaList:['รหัสไปรษณีย์','63000',]},
            {name:'อำเภอบ้านตาก', areaList:['รหัสไปรษณีย์','63120',]},
            {name:'อำเภอสามเงา', areaList:['รหัสไปรษณีย์','63130',]},
            {name:'อำเภอแม่ระมาด', areaList:['รหัสไปรษณีย์','63140',]},
            {name:'อำเภอท่าสองยาง', areaList:['รหัสไปรษณีย์','63150',]},
            {name:'อำเภอแม่สอด', areaList:['รหัสไปรษณีย์','63110',]},
            {name:'อำเภอพบพระ', areaList:['รหัสไปรษณีย์','63160',]},
            {name:'อำเภออุ้มผาง', areaList:['รหัสไปรษณีย์','63170',]},
            {name:'อำเภอวังเจ้า', areaList:['รหัสไปรษณีย์','63000',]},
        ] },
        { name:'สุโขทัย',cityList:[ {name:'อำเภอเมืองสุโขทัย', areaList:['รหัสไปรษณีย์','64000','64220','64210',]},
            {name:'อำเภอบ้านด่านลานหอย', areaList:['รหัสไปรษณีย์','64140',]},
            {name:'อำเภอคีรีมาศ', areaList:['รหัสไปรษณีย์','64160',]},
            {name:'อำเภอกงไกรลาศ', areaList:['รหัสไปรษณีย์','64170',]},
            {name:'อำเภอศรีสัชนาลัย', areaList:['รหัสไปรษณีย์','64130','64190',]},
            {name:'อำเภอศรีสำโรง', areaList:['รหัสไปรษณีย์','64120',]},
            {name:'อำเภอสวรรคโลก', areaList:['รหัสไปรษณีย์','64110',]},
            {name:'อำเภอศรีนคร', areaList:['รหัสไปรษณีย์','64180',]},
            {name:'อำเภอทุ่งเสลี่ยม', areaList:['รหัสไปรษณีย์','64230','64150',]},
        ] },
        { name:'พิษณุโลก',cityList:[ {name:'อำเภอเมืองพิษณุโลก', areaList:['รหัสไปรษณีย์','65000','65230',]},
            {name:'อำเภอนครไทย', areaList:['รหัสไปรษณีย์','65120',]},
            {name:'อำเภอชาติตระการ', areaList:['รหัสไปรษณีย์','65170',]},
            {name:'อำเภอบางระกำ', areaList:['รหัสไปรษณีย์','65140','65240',]},
            {name:'อำเภอบางกระทุ่ม', areaList:['รหัสไปรษณีย์','65110','65210',]},
            {name:'อำเภอพรหมพิราม', areaList:['รหัสไปรษณีย์','65150','65180',]},
            {name:'อำเภอวัดโบสถ์', areaList:['รหัสไปรษณีย์','65160',]},
            {name:'อำเภอวังทอง', areaList:['รหัสไปรษณีย์','65130','65220',]},
            {name:'อำเภอเนินมะปราง', areaList:['รหัสไปรษณีย์','65190',]},
        ] },
        { name:'พิจิตร',cityList:[ {name:'อำเภอเมืองพิจิตร', areaList:['รหัสไปรษณีย์','66000','66170',]},
            {name:'อำเภอวังทรายพูน', areaList:['รหัสไปรษณีย์','66180',]},
            {name:'อำเภอโพธิ์ประทับช้าง', areaList:['รหัสไปรษณีย์','66190',]},
            {name:'อำเภอตะพานหิน', areaList:['รหัสไปรษณีย์','66110','66150',]},
            {name:'อำเภอบางมูลนาก', areaList:['รหัสไปรษณีย์','66120','66210',]},
            {name:'อำเภอโพทะเล', areaList:['รหัสไปรษณีย์','66130',]},
            {name:'อำเภอสามง่าม', areaList:['รหัสไปรษณีย์','66140','66220',]},
            {name:'อำเภอทับคล้อ', areaList:['รหัสไปรษณีย์','66150','66230',]},
            {name:'อำเภอสากเหล็ก', areaList:['รหัสไปรษณีย์','66160',]},
            {name:'อำเภอบึงนาราง', areaList:['รหัสไปรษณีย์','66130',]},
            {name:'อำเภอดงเจริญ', areaList:['รหัสไปรษณีย์','66210',]},
            {name:'อำเภอวชิรบารมี', areaList:['รหัสไปรษณีย์','66140','66220',]},
        ] },
        { name:'เพชรบูรณ์',cityList:[ {name:'อำเภอเมืองเพชรบูรณ์', areaList:['รหัสไปรษณีย์','67000','67250','67210',]},
            {name:'อำเภอชนแดน', areaList:['รหัสไปรษณีย์','67150','67190',]},
            {name:'อำเภอหล่มสัก', areaList:['รหัสไปรษณีย์','67110',]},
            {name:'อำเภอหล่มเก่า', areaList:['รหัสไปรษณีย์','67120',]},
            {name:'อำเภอวิเชียรบุรี', areaList:['รหัสไปรษณีย์','67130','67180',]},
            {name:'อำเภอศรีเทพ', areaList:['รหัสไปรษณีย์','67170',]},
            {name:'อำเภอหนองไผ่', areaList:['รหัสไปรษณีย์','67140','67220',]},
            {name:'อำเภอบึงสามพัน', areaList:['รหัสไปรษณีย์','67160','67230',]},
            {name:'อำเภอน้ำหนาว', areaList:['รหัสไปรษณีย์','67260',]},
            {name:'อำเภอวังโป่ง', areaList:['รหัสไปรษณีย์','67240',]},
            {name:'อำเภอเขาค้อ', areaList:['รหัสไปรษณีย์','67270','67280',]},
        ] },
        { name:'ราชบุรี',cityList:[ {name:'อำเภอเมืองราชบุรี', areaList:['รหัสไปรษณีย์','70000',]},
            {name:'อำเภอจอมบึง', areaList:['รหัสไปรษณีย์','70150',]},
            {name:'อำเภอสวนผึ้ง', areaList:['รหัสไปรษณีย์','70180',]},
            {name:'อำเภอดำเนินสะดวก', areaList:['รหัสไปรษณีย์','70130','70210',]},
            {name:'อำเภอบ้านโป่ง', areaList:['รหัสไปรษณีย์','70110','70190',]},
            {name:'อำเภอบางแพ', areaList:['รหัสไปรษณีย์','70160',]},
            {name:'อำเภอโพธาราม', areaList:['รหัสไปรษณีย์','70120',]},
            {name:'อำเภอปากท่อ', areaList:['รหัสไปรษณีย์','70140',]},
            {name:'อำเภอวัดเพลง', areaList:['รหัสไปรษณีย์','70170',]},
            {name:'อำเภอบ้านคา', areaList:['รหัสไปรษณีย์','70180',]},
        ] },
        { name:'กาญจนบุรี',cityList:[ {name:'อำเภอเมืองกาญจนบุรี', areaList:['รหัสไปรษณีย์','71000','71190',]},
            {name:'อำเภอไทรโยค', areaList:['รหัสไปรษณีย์','71150',]},
            {name:'อำเภอบ่อพลอย', areaList:['รหัสไปรษณีย์','71160','71220',]},
            {name:'อำเภอศรีสวัสดิ์', areaList:['รหัสไปรษณีย์','71250','71220',]},
            {name:'อำเภอท่ามะกา', areaList:['รหัสไปรษณีย์','71120','71130','70190',]},
            {name:'อำเภอท่าม่วง', areaList:['รหัสไปรษณีย์','71110','71130',]},
            {name:'อำเภอทองผาภูมิ', areaList:['รหัสไปรษณีย์','71180',]},
            {name:'อำเภอสังขละบุรี', areaList:['รหัสไปรษณีย์','71240',]},
            {name:'อำเภอพนมทวน', areaList:['รหัสไปรษณีย์','71140','71170',]},
            {name:'อำเภอเลาขวัญ', areaList:['รหัสไปรษณีย์','71210',]},
            {name:'อำเภอด่านมะขามเตี้ย', areaList:['รหัสไปรษณีย์','71260',]},
            {name:'อำเภอหนองปรือ', areaList:['รหัสไปรษณีย์','71220',]},
            {name:'อำเภอห้วยกระเจา', areaList:['รหัสไปรษณีย์','71170',]},
        ] },
        { name:'สุพรรณบุรี',cityList:[ {name:'อำเภอเมืองสุพรรณบุรี', areaList:['รหัสไปรษณีย์','72000','72230','72210',]},
            {name:'อำเภอเดิมบางนางบวช', areaList:['รหัสไปรษณีย์','72120',]},
            {name:'อำเภอด่านช้าง', areaList:['รหัสไปรษณีย์','72180',]},
            {name:'อำเภอบางปลาม้า', areaList:['รหัสไปรษณีย์','72150',]},
            {name:'อำเภอศรีประจันต์', areaList:['รหัสไปรษณีย์','72140',]},
            {name:'อำเภอดอนเจดีย์', areaList:['รหัสไปรษณีย์','72170','72250',]},
            {name:'อำเภอสองพี่น้อง', areaList:['รหัสไปรษณีย์','72110','72190',]},
            {name:'อำเภอสามชุก', areaList:['รหัสไปรษณีย์','72130',]},
            {name:'อำเภออู่ทอง', areaList:['รหัสไปรษณีย์','72160','72220',]},
            {name:'อำเภอหนองหญ้าไซ', areaList:['รหัสไปรษณีย์','72240',]},
        ] },
        { name:'นครปฐม',cityList:[ {name:'อำเภอเมืองนครปฐม', areaList:['รหัสไปรษณีย์','73000',]},
            {name:'อำเภอกำแพงแสน', areaList:['รหัสไปรษณีย์','73140','73180',]},
            {name:'อำเภอนครชัยศรี', areaList:['รหัสไปรษณีย์','73120',]},
            {name:'อำเภอดอนตูม', areaList:['รหัสไปรษณีย์','73150',]},
            {name:'อำเภอบางเลน', areaList:['รหัสไปรษณีย์','73130','73190',]},
            {name:'อำเภอสามพราน', areaList:['รหัสไปรษณีย์','73110','73210','73220','73160',]},
            {name:'อำเภอพุทธมณฑล', areaList:['รหัสไปรษณีย์','73170',]},
        ] },
        { name:'สมุทรสาคร',cityList:[ {name:'อำเภอเมืองสมุทรสาคร', areaList:['รหัสไปรษณีย์','74000',]},
            {name:'อำเภอกระทุ่มแบน', areaList:['รหัสไปรษณีย์','74110','74130',]},
            {name:'อำเภอบ้านแพ้ว', areaList:['รหัสไปรษณีย์','74120',]},
        ] },
        { name:'สมุทรสงคราม',cityList:[ {name:'อำเภอเมืองสมุทรสงคราม', areaList:['รหัสไปรษณีย์','75000',]},
            {name:'อำเภอบางคนที', areaList:['รหัสไปรษณีย์','75120',]},
            {name:'อำเภออัมพวา', areaList:['รหัสไปรษณีย์','75110',]},
        ] },
        { name:'เพชรบุรี',cityList:[ {name:'อำเภอเมืองเพชรบุรี', areaList:['รหัสไปรษณีย์','76000','76100',]},
            {name:'อำเภอเขาย้อย', areaList:['รหัสไปรษณีย์','76140',]},
            {name:'อำเภอหนองหญ้าปล้อง', areaList:['รหัสไปรษณีย์','76160',]},
            {name:'อำเภอชะอำ', areaList:['รหัสไปรษณีย์','76120',]},
            {name:'อำเภอท่ายาง', areaList:['รหัสไปรษณีย์','76130',]},
            {name:'อำเภอบ้านลาด', areaList:['รหัสไปรษณีย์','76150',]},
            {name:'อำเภอบ้านแหลม', areaList:['รหัสไปรษณีย์','76110','76100',]},
            {name:'อำเภอแก่งกระจาน', areaList:['รหัสไปรษณีย์','76170',]},
        ] },
        { name:'ประจวบคีรีขันธ์',cityList:[ {name:'อำเภอเมืองประจวบคีรีขันธ์', areaList:['รหัสไปรษณีย์','77000','77210',]},
            {name:'อำเภอกุยบุรี', areaList:['รหัสไปรษณีย์','77150',]},
            {name:'อำเภอทับสะแก', areaList:['รหัสไปรษณีย์','77130',]},
            {name:'อำเภอบางสะพาน', areaList:['รหัสไปรษณีย์','77140','77230','77190',]},
            {name:'อำเภอบางสะพานน้อย', areaList:['รหัสไปรษณีย์','77170',]},
            {name:'อำเภอปราณบุรี', areaList:['รหัสไปรษณีย์','77120','77220',]},
            {name:'อำเภอหัวหิน', areaList:['รหัสไปรษณีย์','77110',]},
            {name:'อำเภอสามร้อยยอด', areaList:['รหัสไปรษณีย์','77120','77180',]},
        ] },
        { name:'นครศรีธรรมราช',cityList:[ {name:'อำเภอเมืองนครศรีธรรมราช', areaList:['รหัสไปรษณีย์','80000','80280','80330',]},
            {name:'อำเภอพรหมคีรี', areaList:['รหัสไปรษณีย์','80320',]},
            {name:'อำเภอลานสกา', areaList:['รหัสไปรษณีย์','80230',]},
            {name:'อำเภอฉวาง', areaList:['รหัสไปรษณีย์','80150','80250','80260',]},
            {name:'อำเภอพิปูน', areaList:['รหัสไปรษณีย์','80270',]},
            {name:'อำเภอเชียรใหญ่', areaList:['รหัสไปรษณีย์','80190',]},
            {name:'อำเภอชะอวด', areaList:['รหัสไปรษณีย์','80180',]},
            {name:'อำเภอท่าศาลา', areaList:['รหัสไปรษณีย์','80160',]},
            {name:'อำเภอทุ่งสง', areaList:['รหัสไปรษณีย์','80110','80310',]},
            {name:'อำเภอนาบอน', areaList:['รหัสไปรษณีย์','80220',]},
            {name:'อำเภอทุ่งใหญ่', areaList:['รหัสไปรษณีย์','80240',]},
            {name:'อำเภอปากพนัง', areaList:['รหัสไปรษณีย์','80140','80330',]},
            {name:'อำเภอร่อนพิบูลย์', areaList:['รหัสไปรษณีย์','80130','80350',]},
            {name:'อำเภอสิชล', areaList:['รหัสไปรษณีย์','80120','80340',]},
            {name:'อำเภอขนอม', areaList:['รหัสไปรษณีย์','80210',]},
            {name:'อำเภอหัวไทร', areaList:['รหัสไปรษณีย์','80170',]},
            {name:'อำเภอบางขัน', areaList:['รหัสไปรษณีย์','80360',]},
            {name:'อำเภอถ้ำพรรณรา', areaList:['รหัสไปรษณีย์','80260',]},
            {name:'อำเภอจุฬาภรณ์', areaList:['รหัสไปรษณีย์','80180','80130',]},
            {name:'อำเภอพระพรหม', areaList:['รหัสไปรษณีย์','80000',]},
            {name:'อำเภอนบพิตำ', areaList:['รหัสไปรษณีย์','80160',]},
            {name:'อำเภอช้างกลาง', areaList:['รหัสไปรษณีย์','80250',]},
            {name:'อำเภอเฉลิมพระเกียรติ', areaList:['รหัสไปรษณีย์','80190','80290',]},
        ] },
        { name:'กระบี่',cityList:[ {name:'อำเภอเมืองกระบี่', areaList:['รหัสไปรษณีย์','81000',]},
            {name:'อำเภอเขาพนม', areaList:['รหัสไปรษณีย์','81140','80240',]},
            {name:'อำเภอเกาะลันตา', areaList:['รหัสไปรษณีย์','81150','81120',]},
            {name:'อำเภอคลองท่อม', areaList:['รหัสไปรษณีย์','81120','81170',]},
            {name:'อำเภออ่าวลึก', areaList:['รหัสไปรษณีย์','81110',]},
            {name:'อำเภอปลายพระยา', areaList:['รหัสไปรษณีย์','81160',]},
            {name:'อำเภอลำทับ', areaList:['รหัสไปรษณีย์','81120',]},
            {name:'อำเภอเหนือคลอง', areaList:['รหัสไปรษณีย์','81130',]},
        ] },
        { name:'พังงา',cityList:[ {name:'อำเภอเมืองพังงา', areaList:['รหัสไปรษณีย์','82000',]},
            {name:'อำเภอเกาะยาว', areaList:['รหัสไปรษณีย์','82160','83000',]},
            {name:'อำเภอกะปง', areaList:['รหัสไปรษณีย์','82170',]},
            {name:'อำเภอตะกั่วทุ่ง', areaList:['รหัสไปรษณีย์','82130','82140',]},
            {name:'อำเภอตะกั่วป่า', areaList:['รหัสไปรษณีย์','82110','82190',]},
            {name:'อำเภอคุระบุรี', areaList:['รหัสไปรษณีย์','82150',]},
            {name:'อำเภอทับปุด', areaList:['รหัสไปรษณีย์','82180',]},
            {name:'อำเภอท้ายเหมือง', areaList:['รหัสไปรษณีย์','82120',]},
        ] },
        { name:'ภูเก็ต',cityList:[ {name:'อำเภอเมืองภูเก็ต', areaList:['รหัสไปรษณีย์','83000','83130','83100',]},
            {name:'อำเภอกะทู้', areaList:['รหัสไปรษณีย์','83120','83150',]},
            {name:'อำเภอถลาง', areaList:['รหัสไปรษณีย์','83110',]},
        ] },
        { name:'สุราษฎร์ธานี',cityList:[ {name:'อำเภอเมืองสุราษฎร์ธานี', areaList:['รหัสไปรษณีย์','84000','84100',]},
            {name:'อำเภอกาญจนดิษฐ์', areaList:['รหัสไปรษณีย์','84290','84160',]},
            {name:'อำเภอดอนสัก', areaList:['รหัสไปรษณีย์','84220','84160','84340',]},
            {name:'อำเภอเกาะสมุย', areaList:['รหัสไปรษณีย์','84140','84310','84320','84330',]},
            {name:'อำเภอเกาะพะงัน', areaList:['รหัสไปรษณีย์','84280',]},
            {name:'อำเภอไชยา', areaList:['รหัสไปรษณีย์','84110',]},
            {name:'อำเภอท่าชนะ', areaList:['รหัสไปรษณีย์','84170',]},
            {name:'อำเภอคีรีรัฐนิคม', areaList:['รหัสไปรษณีย์','84180',]},
            {name:'อำเภอบ้านตาขุน', areaList:['รหัสไปรษณีย์','84230',]},
            {name:'อำเภอพนม', areaList:['รหัสไปรษณีย์','84250',]},
            {name:'อำเภอท่าฉาง', areaList:['รหัสไปรษณีย์','84150',]},
            {name:'อำเภอบ้านนาสาร', areaList:['รหัสไปรษณีย์','84120','84270',]},
            {name:'อำเภอบ้านนาเดิม', areaList:['รหัสไปรษณีย์','84240',]},
            {name:'อำเภอเคียนซา', areaList:['รหัสไปรษณีย์','84260','84210',]},
            {name:'อำเภอเวียงสระ', areaList:['รหัสไปรษณีย์','84190',]},
            {name:'อำเภอพระแสง', areaList:['รหัสไปรษณีย์','84210',]},
            {name:'อำเภอพุนพิน', areaList:['รหัสไปรษณีย์','84130',]},
            {name:'อำเภอชัยบุรี', areaList:['รหัสไปรษณีย์','84350',]},
            {name:'อำเภอวิภาวดี', areaList:['รหัสไปรษณีย์','84180',]},
        ] },
        { name:'ระนอง',cityList:[ {name:'อำเภอเมืองระนอง', areaList:['รหัสไปรษณีย์','85000','85130',]},
            {name:'อำเภอละอุ่น', areaList:['รหัสไปรษณีย์','85130',]},
            {name:'อำเภอกะเปอร์', areaList:['รหัสไปรษณีย์','85120',]},
            {name:'อำเภอกระบุรี', areaList:['รหัสไปรษณีย์','85110',]},
            {name:'อำเภอสุขสำราญ', areaList:['รหัสไปรษณีย์','85120',]},
        ] },
        { name:'ชุมพร',cityList:[ {name:'อำเภอเมืองชุมพร', areaList:['รหัสไปรษณีย์','86000','86120','86190','86100',]},
            {name:'อำเภอท่าแซะ', areaList:['รหัสไปรษณีย์','86140','86190',]},
            {name:'อำเภอปะทิว', areaList:['รหัสไปรษณีย์','86160','86230','86210',]},
            {name:'อำเภอหลังสวน', areaList:['รหัสไปรษณีย์','86110','86150',]},
            {name:'อำเภอละแม', areaList:['รหัสไปรษณีย์','86170',]},
            {name:'อำเภอพะโต๊ะ', areaList:['รหัสไปรษณีย์','86180',]},
            {name:'อำเภอสวี', areaList:['รหัสไปรษณีย์','86130',]},
            {name:'อำเภอทุ่งตะโก', areaList:['รหัสไปรษณีย์','86220',]},
        ] },
        { name:'สงขลา',cityList:[ {name:'อำเภอเมืองสงขลา', areaList:['รหัสไปรษณีย์','90000','90100',]},
            {name:'อำเภอสทิงพระ', areaList:['รหัสไปรษณีย์','90190',]},
            {name:'อำเภอจะนะ', areaList:['รหัสไปรษณีย์','90130',]},
            {name:'อำเภอนาทวี', areaList:['รหัสไปรษณีย์','90160',]},
            {name:'อำเภอเทพา', areaList:['รหัสไปรษณีย์','90150','90260',]},
            {name:'อำเภอสะบ้าย้อย', areaList:['รหัสไปรษณีย์','90210',]},
            {name:'อำเภอระโนด', areaList:['รหัสไปรษณีย์','90140',]},
            {name:'อำเภอกระแสสินธุ์', areaList:['รหัสไปรษณีย์','90270',]},
            {name:'อำเภอรัตภูมิ', areaList:['รหัสไปรษณีย์','90180',]},
            {name:'อำเภอสะเดา', areaList:['รหัสไปรษณีย์','90120','90170','90240',]},
            {name:'อำเภอหาดใหญ่', areaList:['รหัสไปรษณีย์','90110','90250','90230',]},
            {name:'อำเภอนาหม่อม', areaList:['รหัสไปรษณีย์','90310',]},
            {name:'อำเภอควนเนียง', areaList:['รหัสไปรษณีย์','90220',]},
            {name:'อำเภอบางกล่ำ', areaList:['รหัสไปรษณีย์','90110',]},
            {name:'อำเภอสิงหนคร', areaList:['รหัสไปรษณีย์','90280','90330',]},
            {name:'อำเภอคลองหอยโข่ง', areaList:['รหัสไปรษณีย์','90230','90115',]},
        ] },
        { name:'สตูล',cityList:[ {name:'อำเภอเมืองสตูล', areaList:['รหัสไปรษณีย์','91000','91140',]},
            {name:'อำเภอควนโดน', areaList:['รหัสไปรษณีย์','91160',]},
            {name:'อำเภอควนกาหลง', areaList:['รหัสไปรษณีย์','91130',]},
            {name:'อำเภอท่าแพ', areaList:['รหัสไปรษณีย์','91150',]},
            {name:'อำเภอละงู', areaList:['รหัสไปรษณีย์','91110',]},
            {name:'อำเภอทุ่งหว้า', areaList:['รหัสไปรษณีย์','91120',]},
            {name:'อำเภอมะนัง', areaList:['รหัสไปรษณีย์','91130',]},
        ] },
        { name:'ตรัง',cityList:[ {name:'อำเภอเมืองตรัง', areaList:['รหัสไปรษณีย์','92000','92170','92190',]},
            {name:'อำเภอกันตัง', areaList:['รหัสไปรษณีย์','92110',]},
            {name:'อำเภอย่านตาขาว', areaList:['รหัสไปรษณีย์','92140',]},
            {name:'อำเภอปะเหลียน', areaList:['รหัสไปรษณีย์','92120','92180','92140',]},
            {name:'อำเภอสิเกา', areaList:['รหัสไปรษณีย์','92150','92000',]},
            {name:'อำเภอห้วยยอด', areaList:['รหัสไปรษณีย์','92130','92210','92190',]},
            {name:'อำเภอวังวิเศษ', areaList:['รหัสไปรษณีย์','92220','92000',]},
            {name:'อำเภอนาโยง', areaList:['รหัสไปรษณีย์','92170',]},
            {name:'อำเภอรัษฎา', areaList:['รหัสไปรษณีย์','92160','92130',]},
            {name:'อำเภอหาดสำราญ', areaList:['รหัสไปรษณีย์','92120',]},
        ] },
        { name:'พัทลุง',cityList:[ {name:'อำเภอเมืองพัทลุง', areaList:['รหัสไปรษณีย์','93000',]},
            {name:'อำเภอกงหรา', areaList:['รหัสไปรษณีย์','93180','93000',]},
            {name:'อำเภอเขาชัยสน', areaList:['รหัสไปรษณีย์','93130',]},
            {name:'อำเภอตะโหมด', areaList:['รหัสไปรษณีย์','93160',]},
            {name:'อำเภอควนขนุน', areaList:['รหัสไปรษณีย์','93110','93150',]},
            {name:'อำเภอปากพะยูน', areaList:['รหัสไปรษณีย์','93120',]},
            {name:'อำเภอศรีบรรพต', areaList:['รหัสไปรษณีย์','93190',]},
            {name:'อำเภอป่าบอน', areaList:['รหัสไปรษณีย์','93170',]},
            {name:'อำเภอบางแก้ว', areaList:['รหัสไปรษณีย์','93140',]},
            {name:'อำเภอป่าพะยอม', areaList:['รหัสไปรษณีย์','93110',]},
            {name:'อำเภอศรีนครินทร์', areaList:['รหัสไปรษณีย์','93000',]},
        ] },
        { name:'ปัตตานี',cityList:[ {name:'อำเภอเมืองปัตตานี', areaList:['รหัสไปรษณีย์','94000',]},
            {name:'อำเภอโคกโพธิ์', areaList:['รหัสไปรษณีย์','94120','94180',]},
            {name:'อำเภอหนองจิก', areaList:['รหัสไปรษณีย์','94170',]},
            {name:'อำเภอปะนาเระ', areaList:['รหัสไปรษณีย์','94130','94190',]},
            {name:'อำเภอมายอ', areaList:['รหัสไปรษณีย์','94140','94190',]},
            {name:'อำเภอทุ่งยางแดง', areaList:['รหัสไปรษณีย์','94140',]},
            {name:'อำเภอสายบุรี', areaList:['รหัสไปรษณีย์','94110','94190',]},
            {name:'อำเภอไม้แก่น', areaList:['รหัสไปรษณีย์','94220',]},
            {name:'อำเภอยะหริ่ง', areaList:['รหัสไปรษณีย์','94150','94190',]},
            {name:'อำเภอยะรัง', areaList:['รหัสไปรษณีย์','94160',]},
            {name:'อำเภอกะพ้อ', areaList:['รหัสไปรษณีย์','94230',]},
            {name:'อำเภอแม่ลาน', areaList:['รหัสไปรษณีย์','94180',]},
        ] },
        { name:'ยะลา',cityList:[ {name:'อำเภอเมืองยะลา', areaList:['รหัสไปรษณีย์','95000','95160',]},
            {name:'อำเภอเบตง', areaList:['รหัสไปรษณีย์','95110',]},
            {name:'อำเภอบันนังสตา', areaList:['รหัสไปรษณีย์','95130',]},
            {name:'อำเภอธารโต', areaList:['รหัสไปรษณีย์','95150','95170',]},
            {name:'อำเภอยะหา', areaList:['รหัสไปรษณีย์','95120',]},
            {name:'อำเภอรามัน', areaList:['รหัสไปรษณีย์','95140',]},
            {name:'อำเภอกาบัง', areaList:['รหัสไปรษณีย์','95120',]},
            {name:'อำเภอกรงปินัง', areaList:['รหัสไปรษณีย์','95000',]},
        ] },
        { name:'นราธิวาส',cityList:[ {name:'อำเภอเมืองนราธิวาส', areaList:['รหัสไปรษณีย์','96000',]},
            {name:'อำเภอตากใบ', areaList:['รหัสไปรษณีย์','96110',]},
            {name:'อำเภอบาเจาะ', areaList:['รหัสไปรษณีย์','96170',]},
            {name:'อำเภอยี่งอ', areaList:['รหัสไปรษณีย์','96180',]},
            {name:'อำเภอระแงะ', areaList:['รหัสไปรษณีย์','96130','96220',]},
            {name:'อำเภอรือเสาะ', areaList:['รหัสไปรษณีย์','96150',]},
            {name:'อำเภอศรีสาคร', areaList:['รหัสไปรษณีย์','96210',]},
            {name:'อำเภอแว้ง', areaList:['รหัสไปรษณีย์','96160',]},
            {name:'อำเภอสุคิริน', areaList:['รหัสไปรษณีย์','96190',]},
            {name:'อำเภอสุไหงโกลก', areaList:['รหัสไปรษณีย์','96120',]},
            {name:'อำเภอสุไหงปาดี', areaList:['รหัสไปรษณีย์','96140',]},
            {name:'อำเภอจะแนะ', areaList:['รหัสไปรษณีย์','96220',]},
            {name:'อำเภอเจาะไอร้อง', areaList:['รหัสไปรษณีย์','96130',]},
        ] },
    ];
    
            var obj={};
            for(var i=0;i<provinceList.length;i++){
                var b={};
                for(var j=0;j<provinceList[i].cityList.length;j++){
                    b[provinceList[i].cityList[j].name]=provinceList[i].cityList[j].areaList[1]
                }
                obj[provinceList[i].name]=b;
            }
    
    
    
    var data = obj;
    /**
     * twzipcode Constructor
     * @param {Object} container HTML element
     * @param {(Object|string)} options User settings
     * @constructor
     */
    function TWzipcode (container, options) {
        /**
         * Default settings
         * @type {Object}
         */
        var defaults = {
            'countyName': 'state',
            'css': [],
            'detect': false,             // v1.6.7
            'districtName': 'city',
            'googleMapsKey': '', // v1.6.9
            'hideCounty': [], // v1.7.9
            'hideDistrict': [], // v1.7.9
            'onCountySelect': null,      // v1.5
            'onDistrictSelect': null,    // v1.5
            'onZipcodeKeyUp': null,      // v1.5
            'readonly': false,
            'zipcodeName': 'zipcode',
            'zipcodePlaceholder': '郵遞區號',
            'zipcodeIntoDistrict': false, // v1.6.6
        };
        /**
         * DOM of selector
         * @type {Object}
         */
        this.container = $(container);
        /**
         * Merge the options
         * @type {Object}
         */
        this.options = $.extend({}, defaults, options);
        // initialize
        this.init();
    }
    /**
     * TWzipcode prototype
     */
    TWzipcode.prototype = {

        VERSION: '1.7.10',

        /**
         * Method: Get all post data
         * @return {Object}
         */
        data: function () {
            var wrap = this.wrap;
            return 'undefined' !== typeof data[wrap.county.val()] ?
                data[wrap.county.val()] :
                data;
        },
        /**
         * Method: Serialize the data
         * @return {string}
         */
        serialize: function () {
            var result = [],
                obj = {},
                ele = {},
                s = {};
            obj = this.container.find('select,input');
            if (obj.length) {
                obj.each(function () {
                    ele = $(this);
                    result.push(ele.attr('name') + '=' + ele.val());
                });
            } else {
                $(this).children().each(function () {
                    s = $(this);
                    result.push(s.attr('name') + '=' + s.val());
                });
            }
            return result.join('&');
        },
        /**
         * Method: Destroy the container.
         * @this {TWzipcode}
         */
        destroy: function () {
            $.data(this.container.get(0), 'twzipcode', null);
            if (this.container.length) {
                return this.container.empty().off('change.twzipcode keyup.twzipcode blur.twzipcode');
            }
        },
        /**
         * Method: Get elements of instance
         * @param {(string|Array)} opts Type name
         * @param {Function} callback Function callback
         */
        get: function (callback) {
            if ('function' === typeof callback) {
                callback.call(this, this.wrap);
            } else {
                return this.wrap;
            }
        },
        /**
         * Method: Set value for elements.
         * @param {(string|number|Object)} opts Input value
         */
        set: function (opts) {

            var self = this,
                def = {
                    'county': '',
                    'district': '',
                    'zipcode': ''
                },
                opt = $.extend({}, def, opts);

            try {
                if ('string' === typeof opts || 'number' === typeof opts) {
                    self.wrap.zipcode.val(opts).trigger('blur.twzipcode');
                } else {
                    if (opt.zipcode) {
                        self.wrap.zipcode.val(opt.zipcode).trigger('blur.twzipcode');
                    }
                    if (opt.county) {
                        self.wrap.county.val(opt.county).trigger('change.twzipcode');
                    }
                    if (opt.district) {
                        self.wrap.district.val(opt.district).trigger('change.twzipcode');
                    }
                }
            } catch (ignore) {
                console.warn(ignore.message);
            } finally {
                return self.container;
            }
        },
        /**
         * Method: Reset the selected items to default.
         * @this {TWzipcode}
         */
        reset: function (container, obj) {
            var self = this,
                wrap = self.wrap,
                opts = self.options,
                county = '',
                list = {
                    'county': '<option value="">- - กรุณาเลือกจังหวัด - -</option>',
                    'district': '<option value="">- - กรุณาเลือกอำเภอ/เขต  - -</option>'
                },
                tpl = [];

            switch (obj) {
                case 'district':
                    wrap.district.html(list.district);
                    break;
                default:
                    wrap.county.html(list.county);
                    wrap.district.html(list.district);
                    for (county in data) {
                        if ('undefined' !== typeof data[county] && -1 === opts.hideCounty.indexOf(county)) {
                            tpl.push('<option value="' + county + '">' + county + '</option>');
                        }
                    }
                    $(tpl.join('')).appendTo(wrap.county);
                    break;
            }
            wrap.zipcode.val('');
        },
        /**
         * Binding the event of the elements
         * @this {TWzipcode}
         */
        bindings: function () {

            var self = this,
                opts = self.options,
                wrap = self.wrap,
                dz   = '',
                dc   = '',
                dd   = '';

            // county
            wrap.county.on('change.twzipcode', function () {
                var val = $(this).val(),
                    district = '',
                    tpl = [];

                wrap.district.empty();

                if (val) {
                    if (true === opts.zipcodeIntoDistrict) {
                        for (district in data[val]) {
                            if ('undefined' !== typeof data[val][district] &&
                                (-1 === opts.hideDistrict.indexOf(district) && -1 === opts.hideDistrict.indexOf(data[val][district]))
                            ) {
                                tpl.push('<option value="' + district + '">');
                                tpl.push(data[val][district] + ' ' + district);
                                tpl.push('</option>');
                            }
                        }
                    } else {
                        for (district in data[val]) {
                            if ('undefined' !== typeof data[val][district] &&
                                (-1 === opts.hideDistrict.indexOf(district) && -1 === opts.hideDistrict.indexOf(data[val][district]))
                            ) {
                                tpl.push('<option value="' + district + '">');
                                tpl.push(district);
                                tpl.push('</option>');
                            }
                        }
                    }
                    wrap.district.append(tpl.join('')).trigger('change.twzipcode');
                } else {
                    wrap.county.find('option:first').prop('selected', true);
                    self.reset('district');
                }
                // County callback binding
                if ('function' === typeof opts.onCountySelect) {
                    opts.onCountySelect.call(this);
                }
            });
            // District
            wrap.district.on('change.twzipcode', function () {
                var val = $(this).val();
                if (wrap.county.val()) {
                    wrap.zipcode.val(data[wrap.county.val()][val]);
                }
                // District callback binding
                if ('function' === typeof opts.onDistrictSelect) {
                    opts.onDistrictSelect.call(this);
                }
            });
            // Zipcode
            wrap.zipcode.on('keyup.twzipcode blur.twzipcode', function () {

                var obj = $(this),
                    val = '',
                    i   = '',
                    j   = '';
                obj.val(obj.val().replace(/[^0-9]/g, ''));
                val = obj.val().toString();

                if (3 === val.length) {
                    for (i in data) {
                        if ('undefined' !== typeof data[i]) {
                            for (j in data[i]) {
                                if ('undefined' !== typeof data[i][j] &&
                                    val === data[i][j]
                                ) {
                                    wrap.county.val(i).trigger('change.twzipcode');
                                    wrap.district.val(j).trigger('change.twzipcode');
                                    break;
                                }
                            }
                        }
                    }
                }
                // Zipcode callback binding
                if ('function' === typeof opts.onZipcodeKeyUp) {
                    opts.onZipcodeKeyUp.call(this);
                }
            });

            dz = 'undefined' !== typeof opts.zipcodeSel ?
                opts.zipcodeSel :
                (
                    'undefined' !== typeof self.role.zipcode.data('value') ?
                        self.role.zipcode.data('value') :
                        opts.zipcodeSel
                );

            dc = 'undefined' !== typeof opts.countySel ?
                opts.countySel :
                (
                    'undefined' !== typeof self.role.county.data('value') ?
                        self.role.county.data('value') :
                        opts.countySel
                );

            dd = 'undefined' !== typeof opts.districtSel ?
                opts.districtSel :
                (
                    'undefined' !== typeof self.role.district.data('value') ?
                        self.role.district.data('value') :
                        opts.districtSel
                );

            // Default value
            if (dc) {
                self.wrap.county.val(dc).trigger('change.twzipcode');
                if ('undefined' !== typeof data[dc][dd]) {
                    self.wrap.district.val(dd).trigger('change.twzipcode');
                }
            }
            if (dz && 3 === dz.toString().length) {
                self.wrap.zipcode.val(dz).trigger('blur.twzipcode');
            }
        },
        /**
         * Geolocation detect
         * @this {TWzipcode}
         */
        geoLocation: function () {

            var self = this,
                geolocation = navigator.geolocation,
                options = {
                    'maximumAge': 600000,
                    'timeout': 3000,
                    'enableHighAccuracy': false
                },
                opts = self.options;

            if (!geolocation) {
                return;
            }

            geolocation.getCurrentPosition(
                function (loc) {

                    var latlng = {};
                    if (('coords' in loc) &&
                        ('latitude' in loc.coords) &&
                        ('longitude' in loc.coords)
                    ) {
                        latlng = [loc.coords.latitude, loc.coords.longitude];
                        $.getJSON(
                            'https://maps.googleapis.com/maps/api/geocode/json',
                            {
                                'key': opts.googleMapsKey,
                                'sensor': false,
                                'latlng': latlng.join(',')
                            },
                            function (data) {
                                var postal = '';
                                if (data &&
                                    'undefined' !== typeof data.results &&
                                    'undefined' !== typeof data.results[0].address_components &&
                                    'undefined' !== typeof data.results[0].address_components[0]
                                ) {
                                    postal = data.results[0]
                                        .address_components[data.results[0].address_components.length - 1]
                                        .long_name;
                                    if (postal) {
                                        self.wrap.zipcode.val(postal.toString()).trigger('blur.twzipcode');
                                    }
                                }
                            });
                    }
                },
                function (error) {
                    console.error(error);
                },
                options
            );
        },
        /**
         * twzipcode Initialize
         * @this {TWzipcode}
         */
        init: function () {

            var self = this,
                container = self.container,
                opts = self.options,
                role = {
                    county: container.find('[data-role=county]:first'),
                    district: container.find('[data-role=district]:first'),
                    zipcode: container.find('[data-role=zipcode]:first')
                },
                countyName = role.county.data('name') || opts.countyName,
                districtName = role.district.data('name') || opts.districtName,
                zipcodeName = role.zipcode.data('name') || opts.zipcodeName,
                zipcodePlaceholder = role.zipcode.data('placeholder') || opts.zipcodePlaceholder,
                readonly = role.zipcode.data('readonly') || opts.readonly;

            // Elements create
            $('<select/>')
                .attr('name', countyName)
                .addClass(role.county.data('style') || ('undefined' !== typeof opts.css[0] ? opts.css[0] : ''))
                .appendTo(role.county.length ? role.county : container);

            $('<select/>')
                .attr('name', districtName)
                .addClass(role.district.data('style') || ('undefined' !== typeof opts.css[1] ? opts.css[1] : ''))
                .appendTo(role.district.length ? role.district : container);

            $('<input/>')
                .attr({'type': 'text', 'name': zipcodeName, 'placeholder': zipcodePlaceholder})
                .prop('readonly', readonly)
                .addClass(role.zipcode.data('style') || ('undefined' !== typeof opts.css[2] ? opts.css[2] : ''))
                .appendTo(role.zipcode.length ? role.zipcode : container);

            self.wrap = {
                'county': container.find('select[name="' + countyName + '"]:first'),
                'district': container.find('select[name="' + districtName + '"]:first'),
                'zipcode': container.find('input[type=text][name="' + zipcodeName + '"]:first')
            };

            if (true === opts.zipcodeIntoDistrict) {
                self.wrap.zipcode.hide();
            }

            self.role = role;
            // Reset the elements
            self.reset();
            // Elements events binding
            self.bindings();
            // Geolocation
            if (true === opts.detect) {
                self.geoLocation();
            }
        }
    };
    /**
     * jQuery twzipcode instance
     * @param {Object} options Plugin settings
     * @public
     */
    $.fn.twzipcode = function (options) {
        var instance = {},
            result = [],
            args = arguments,
            id  = 'twzipcode';
        if ('string' === typeof options) {
            this.each(function () {
                instance = $.data(this, id);
                if (instance instanceof TWzipcode && 'function' === typeof instance[options]) {
                    result = instance[options].apply(instance, Array.prototype.slice.call(args, 1));
                }
            });
            return 'undefined' !== typeof result ? result : this;
        } else {
            return this.each(function () {
                if (!$.data(this, id)) {
                    $.data(this, id, new TWzipcode(this, options));
                }
            });
        }
    };

})(window.jQuery || {}, window, document);

var _BlackList = new Array("孔文吉","江啟臣","吳琪銘","李麗芬","林俊憲","施義芳","徐國勇","陳亭妃","陳賴素美","許淑華","黃偉哲","蔡易馀","鄭運鵬","賴士葆","蘇巧慧","尤美女","何欣純","呂玉玲","林昶佐","柯志恩","徐榛蔚","陳素月","馬文君","許智傑","黃國昌","蔡培慧","鄭麗君","賴瑞隆","蘇治芬","王定宇","余宛如","呂孫綾","邱志偉","林為洲","柯建銘","莊瑞雄","陳曼麗","高志鵬","許毓仁","黃國書","蔡適應","鄭寶清","鐘孔炤","蘇嘉全","王育敏","吳玉琴","李昆澤","邱泰源","林淑芬","段宜康","郭正亮","陳雪生","高金素梅","曾銘宗","楊曜","蔣乃辛","劉世芳","鐘佳濱","蘇震清","王金平","吳志揚","李俊俋","邱議瑩","林德福","洪宗熠","陳其邁","陳超明","葉宜津","楊鎭浯","蔣萬安","劉建國","簡東明","顧立雄","羅致政","蕭美琴","鄭天財","蔡其昌","黃昭順","張麗善","陳學聖","陳明文","徐志榮","姚文智","林岱樺","李鴻鈞","吳焜裕","江永昌","羅明才","盧秀燕","趙正宇","管碧玲","黃秀芳","張廖萬堅","陳瑩","陳怡潔","徐永明","林麗蟬","周陳秀霞","李應元","吳思瑤","王榮璋","顏寬恒","劉櫂豪","趙天麟","廖國棟","費鴻泰","張宏陸","陳歐珀","陳宜民","洪慈庸","林靜儀","周春米","李彥秀","吳秉叡","王惠美","高潞·以用·巴魕剌","孔文吉","尤美女","王育敏","王定宇","王金平","王惠美","王榮璋","江永昌","江啟臣","何欣純","餘宛如","吳玉琴","吳志揚","吳秉叡","吳思瑤","吳焜裕","吳琪銘","呂玉玲","呂孫綾","李昆澤","李俊俋","李彥秀","李應元","李鴻鈞","李麗芬","周春米","周陳秀霞","林岱樺","林俊憲","林昶佐","林為洲","林淑芬","林德福","林靜儀","林麗蟬","邱志偉","邱泰源","邱議瑩","姚文智","施義芳","柯志恩","柯建銘","段宜康","洪宗熠","洪慈庸","徐永明","徐志榮","徐國勇","徐榛蔚","馬文君","高志鵬","高金素梅","張宏陸","張廖萬堅","張麗善","莊瑞雄","許淑華","許智傑","許毓仁","郭正亮","陳其邁","陳宜民","陳怡潔","陳明文","陳亭妃","陳素月","陳曼麗","陳雪生","陳超明","陳歐珀","陳瑩 ","陳學聖","陳賴素美","曾銘宗","費鴻泰","黃秀芳","黃昭順","黃偉哲","黃國昌","黃國書","楊曜 ","楊鎮浯","萬國書","葉宜津","廖國棟","管碧玲","趙天麟","趙正宇","劉世芳","劉建國","劉櫂豪","蔡其昌","蔡易餘","蔡培慧","蔡適應","蔣乃辛","蔣萬安","鄭天財","鄭運鵬","鄭麗君","鄭寶清","盧秀燕","蕭美琴","賴士葆","賴瑞隆","鍾孔炤","鍾佳濱","簡東明","顏寬恆","羅明才","羅致政","蘇巧慧","蘇治芬","蘇嘉全","蘇震清","顧立雄");

function _checkBlackName(name){
    for(var s in _BlackList){
        if(name.indexOf(_BlackList[s])>=0){
            return true;
        }
    }
    return false;
}

//#EOF
